{
  "cjc-1295, ipamorelin": {
    "title": "CJC-1295 (no DAC), Ipamorelin 10mg (Blend)",
    "citations": [
      "K. Raun et al., “Ipamorelin, the first selective growth hormone secretagogue,” Eur. J. Endocrinol., vol. 139, no. 5, pp. 552–561, Nov. 1998. [PubMed]",
      "N. B. Andersen, K. Malmlöf, P. B. Johansen, T. T. Andreassen, G. Ørtoft, and H. Oxlund, “The growth hormone secretagogue ipamorelin counteracts glucocorticoid-induced decrease in bone formation of adult rats,” Growth Horm. IGF Res. Off. J. Growth Horm. Res. Soc. Int. IGF Res. Soc., vol. 11, no. 5, pp. 266–272, Oct. 2001. [PubMed]",
      "J. Svensson et al., “The GH secretagogues ipamorelin and GH-releasing peptide-6 increase bone mineral content in adult female rats,” J. Endocrinol., vol. 165, no. 3, pp. 569–577, Jun. 2000. [PubMed]",
      "E. Adeghate and A. S. Ponery, “Mechanism of ipamorelin-evoked insulin release from the pancreas of normal and diabetic rats,” Neuro Endocrinol. Lett., vol. 25, no. 6, pp. 403–406, Dec. 2004. [PubMed]",
      "D. E. Beck, W. B. Sweeney, M. D. McCarter, and Ipamorelin 201 Study Group, “Prospective, randomized, controlled, proof-of-concept study of the Ghrelin mimetic ipamorelin for the management of postoperative ileus in bowel resection patients,” Int. J. Colorectal Dis., vol. 29, no. 12, pp. 1527–1534, Dec. 2014. [PubMed]",
      "B. Greenwood-Van Meerveld, K. Tyler, E. Mohammadi, and C. Pietra, “Efficacy of ipamorelin, a ghrelin mimetic, on gastric dysmotility in a rodent model of postoperative ileus,” J. Exp. Pharmacol., vol. 4, pp. 149–165, Oct. 2012. [PubMed]",
      "M. Alba et al., “Once-daily administration of CJC-1295, a long-acting growth hormone-releasing hormone (GHRH) analog, normalizes growth in the GHRH knockout mouse,” Am. J. Physiol. Endocrinol. Metab., vol. 291, no. 6, pp. E1290-1294, Dec. 2006. [PubMed]",
      "M. Ionescu and L. A. Frohman, “Pulsatile secretion of growth hormone (GH) persists during continuous stimulation by CJC-1295, a long-acting GH-releasing hormone analog,” J. Clin. Endocrinol. Metab., vol. 91, no. 12, pp. 4792–4797, Dec. 2006. [PubMed]",
      "M. C. Van Hout and E. Hearne, “Netnography of Female Use of the Synthetic Growth Hormone CJC-1295: Pulses and Potions,” Subst. Use Misuse, vol. 51, no. 1, pp. 73–84, Jan. 2016. [PubMed]",
      "Jetté, Lucie & Leger, Roger & Thibaudeau, Karen & Benquet, Corinne & Robitaille, Martin & Pellerin, Isabelle & Paradis, Véronique & Wyk, Pieter & Pham, Khan & Bridon, Dominique. (2005). hGRF1-29-Albumin Bioconjugates Activate the GRF Receptor on the Anterior Pituitary in Rats: Identification of CJC-1295 as a Long Lasting GRF Analog. [Research Gate]"
    ],
    "articleAuthor": "",
    "scientificJournalAuthor": "Dr. Dominique Bridon holds a Master of Science, Chemical Engineering and Polymer Sciences from Ecole Nationale Supérieure de Chimie and a PhD in Organic Chemistry from the University of Paris XI, ICSN, Orsay, France with Nobel Laureate Sir Derek H. R. Barton as Research Advisor. He completed his Post-Doctoral Research at the University of California, Berkeley. He studied the potential of CJC-1295 as a long lasting GRF analog and also held various leadership positions involving peptide research and technologies at Ipsen, Conjuchem, Redcell, and Abbott Laboratories. Dr. Bridon has served as a Director for Enobia (acquired by Alexion) and Neuronax and as a member of the Scientific Advisory Board of Syntaxin (acquired by Ipsen) and Biosortia. He now brings 30 years of executive and scientific leadership experience to the Epivax Oncology team.\n\nDr. Dominique Bridon is being referenced as one of the leading scientists involved in the research and development of CJC-1295. In no way is this doctor/scientist endorsing or advocating the purchase, sale, or use of this product for any reason. There is no affiliation or relationship, implied or otherwise, between Peptide Sciences and this doctor. The purpose of citing the doctor is to acknowledge, recognize, and credit the exhaustive research and development efforts conducted by the scientists studying this peptide. Dr. Dominique Bridon is listed in [10] under the",
    "researchSections": [
      {
        "heading": "Research Applications",
        "content": "Dual-receptor signaling analysis via GHRHR and GHSR-1a\nPulsatile endocrine signaling and receptor cross-talk studies\ncAMP- and Ca2+-dependent second messenger pathway evaluation\nDownstream IGF-axis modulation in preclinical models"
      },
      {
        "heading": "Preclinical Research Summary",
        "content": "Preclinical studies in cellular and animal models have examined GHRH analogs and ghrelin receptor agonists for receptor selectivity, endocrine pulsatility, and downstream signaling dynamics. All findings are derived from non-clinical research environments."
      }
    ]
  },
  "hexarelin": {
    "title": "Hexarelin",
    "citations": [
      "J. Huang, Y. Li, J. Zhang, Y. Liu, and Q. Lu, “The Growth Hormone Secretagogue Hexarelin Protects Rat Cardiomyocytes From in vivo Ischemia/Reperfusion Injury Through Interleukin-1 Signaling Pathway,” Int. Heart. J., vol. 58, no. 2, pp. 257–263, Apr. 2017. [PubMed]",
      "Y. Mao et al., “Hexarelin treatment in male ghrelin knockout mice after myocardial infarction,” Endocrinology, vol. 154, no. 10, pp. 3847–3854, Oct. 2013. [PubMed]",
      "E. Agbo et al., “Modulation of PTEN by hexarelin attenuates coronary artery ligation-induced heart failure in rats,” Turk. J. Med. Sci., vol. 49, no. 3, May 2019. [PubMed]",
      "H. McDonald et al., “Hexarelin treatment preserves myocardial function and reduces cardiac fibrosis in a mouse model of acute myocardial infarction,” Physiol. Rep., vol. 6, no. 9, p. e13699, 2018. [PubMed]",
      "X. Xu et al., “Chronic administration of hexarelin attenuates cardiac fibrosis in the spontaneously hypertensive rat,” Am. J. Physiol. Heart Circ. Physiol., vol. 303, no. 6, pp. H703-711, Sep. 2012. [PubMed]",
      "X. Zhang, L. Qu, L. Chen, and C. Chen, “Improvement of cardiomyocyte function by in vivo hexarelin treatment in streptozotocin-induced diabetic rats,” Physiol. Rep., vol. 6, no. 4, 2018. [PubMed]",
      "Y. Mao, T. Tokudome, I. Kishimoto, K. Otani, M. Miyazato, and K. Kangawa, “One dose of oral hexarelin protects chronic cardiac function after myocardial infarction,” Peptides, vol. 56, pp. 156–162, Jun. 2014. [PubMed]",
      "R. Mosa et al., “Hexarelin, a Growth Hormone Secretagogue, Improves Lipid Metabolic Aberrations in Nonobese Insulin-Resistant Male MKR Mice,” Endocrinology, vol. 158, no. 10, pp. 3174–3187, 01 2017. [PubMed]",
      "E. Conte et al., “Growth hormone secretagogues prevent dysregulation of skeletal muscle calcium homeostasis in a rat model of cisplatin-induced cachexia,” J. Cachexia Sarcopenia Muscle, vol. 8, no. 3, pp. 386–404, Jun. 2017. [PubMed]"
    ],
    "articleAuthor": "",
    "scientificJournalAuthor": "",
    "researchSections": [
      {
        "heading": "Research Applications",
        "content": "Receptor pharmacology studies involving GHSR signaling and ligand–receptor selectivity\nCellular stress-response experiments assessing survival-associated pathway readouts under defined conditions (e.g., nutrient deprivation or oxidative challenge models)\nMechanistic studies of intracellular calcium dynamics and excitation–contraction coupling markers in cardiomyocyte model systems\nPreclinical investigation of fibrosis-associated molecular endpoints and remodeling-associated signaling in animal models\nMetabolic pathway studies evaluating lipid and insulin-resistance endpoints in defined preclinical models\nSkeletal muscle model research assessing mitochondrial integrity and calcium homeostasis markers in cachexia-associated paradigms"
      },
      {
        "heading": "Preclinical Research Summary",
        "content": "Cardiac Model Systems (Cell Survival, Remodeling Markers, and Functional Readouts)\n\nRodent studies and cardiomyocyte model experiments have evaluated hexarelin in ischemia/reperfusion paradigms and related stress models, measuring apoptosis-associated markers, oxidative stress endpoints, inflammatory mediators, and function-related readouts within controlled experimental designs[1], [2], [4], [5], [8].\n\nPreclinical myocardial injury model readouts comparing experimental groups.\nSource: PubMed\n\nAdditional animal-model work has examined myocardial fibrosis-associated endpoints and remodeling-associated molecular markers in infarction and hypertension-associated paradigms[4], [5]. Studies have also investigated intracellular calcium regulation in in vitro ischemia/reperfusion models as a candidate mechanistic contributor to observed pathway readouts in cardiomyocytes[7], [8].\n\nMechanistic schematic illustrating pathway nodes evaluated in preclinical myocardial injury models.\nSource: PubMed\n\nMetabolic Model Context (Lipid and Insulin-Resistance Endpoints)\n\nIn defined preclinical metabolic models, investigators have reported lipid-related measurements and insulin-resistance endpoints following hexarelin exposure, supporting continued mechanistic study of ghrelin-analogue signaling in metabolic pathway research[9].\n\nSkeletal Muscle and Cachexia-Associated Model Systems\n\nGrowth hormone secretagogue peptides, including hexarelin, have been studied in rat cachexia-associated paradigms to evaluate mitochondrial integrity markers, skeletal muscle calcium homeostasis, and related molecular endpoints under chemotherapy-associated stress conditions[10], [11].\n\nA. Mitochondrial DNA content relative to control\nB. Content of MCH1 and MHC2A mRNA\nC. Protein content of muscle cells relative to control\nSource: PubMed\n\nReceptor Pharmacology and Ligand Development Context\n\nAdditional literature has described the development and characterization of ghrelin receptor ligands, including potency and selectivity assessments and endocrine/extraendocrine signaling observations in preclinical research contexts[12]."
      }
    ]
  },
  "cjc-1295 no dac": {
    "title": "CJC-1295 no DAC (Mod GRF 1-29)",
    "citations": [
      "L. Jetté et al., “Human Growth Hormone-Releasing Factor (hGRF)1–29-Albumin Bioconjugates Activate the GRF Receptor on the Anterior Pituitary in Rats: Identification of CJC-1295 as a Long-Lasting GRF Analog,” Endocrinology, vol. 146, no. 7, pp. 3052–3058, 2005. [PubMed]",
      "L. A. Frohman et al., “Rapid enzymatic degradation of growth hormone-releasing hormone by plasma in vitro and in vivo to a biologically inactive product cleaved at the NH2 terminus,” J. Clin. Invest., vol. 78, no. 4, pp. 906–913, 1986. [PubMed]",
      "J. Izdebski et al., “New potent hGH-RH analogues with increased resistance to enzymatic degradation,” J. Pept. Sci., vol. 8, no. 7, pp. 289–296, 2002. [PubMed]"
    ],
    "articleAuthor": "",
    "scientificJournalAuthor": "",
    "researchSections": [
      {
        "heading": "Research Applications",
        "content": "Modified GRF (1-29) is used in laboratory research to investigate growth hormone–releasing hormone receptor (GHRHR) activation and associated intracellular signaling cascades. The peptide is applied as a tool compound for studying ligand–receptor dynamics, receptor kinetics, and second-messenger pathway modulation in controlled experimental systems.\n\nCommon experimental applications include:\n\nGHRHR binding affinity and kinetics assays\nAdenylate cyclase activation and cyclic AMP signaling studies\nStructure–activity relationship (SAR) comparisons among GRF(1-29) analogues\nEndocrine and neuroendocrine signaling investigations in cellular and animal research models\n\nThe absence of DAC modification is leveraged in experimental design to evaluate transient signaling events without long-acting affinity contributions."
      },
      {
        "heading": "Preclinical Research Summary",
        "content": "Preclinical studies employing Modified GRF (1-29) have focused on receptor activation profiles, comparative potency among GRF analogues, and intracellular signaling kinetics in cell-based systems. In vivo animal studies have been used to examine endocrine-axis signaling regulation and peptide distribution characteristics using established laboratory endpoints.\n\nThese investigations contribute to foundational knowledge regarding peptide hormone signaling mechanisms and receptor pharmacology. All reported findings are derived exclusively from non-clinical experimental systems."
      }
    ]
  },
  "tb-500": {
    "title": "TB-500 (Thymosin Beta-4) (43aa)",
    "citations": [
      "P. Cheng, F. Kuang, H. Zhang, G. Ju, and J. Wang, “Beneficial effects of thymosin β4 on spinal cord injury in the rat,” Neuropharmacology, vol. 85, pp. 408–416, Oct. 2014. [PubMed]",
      "M. Chopp and Z. G. Zhang, “Thymosin β4 as a restorative/regenerative therapy for neurological injury and neurodegenerative diseases,” Expert Opin. Biol. Ther., vol. 15 Suppl 1, pp. S9-12, 2015. [PubMed]",
      "H. Li, Y. Wang, X. Hu, B. Ma, and H. Zhang, “Thymosin beta 4 attenuates oxidative stress-induced injury of spinal cord-derived neural stem/progenitor cells through the TLR4/MyD88 pathway,” Gene, vol. 707, pp. 136–142, May 2019. [PubMed]",
      "K. N. Dubé and N. Smart, “Thymosin β4 and the vasculature: multiple roles in development, repair and protection against disease,” Expert Opin. Biol. Ther., vol. 18, no. sup1, pp. 131–139, 2018. [PubMed]",
      "D. Philp, S. St-Surin, H.-J. Cha, H.-S. Moon, H. K. Kleinman, and M. Elkin, “Thymosin beta 4 induces hair growth via stem cell migration and differentiation,” Ann. N. Y. Acad. Sci., vol. 1112, pp. 95–103, Sep. 2007. [PubMed]",
      "T. W. Carion et al., “Thymosin Beta-4 and Ciprofloxacin Adjunctive Therapy Improves Pseudomonas aeruginosa-Induced Keratitis,” Cells, vol. 7, no. 10, Sep. 2018. [PubMed]",
      "K. M. Kassem, S. Vaid, H. Peng, S. Sarkar, and N.-E. Rhaleb, “Tβ4-Ac-SDKP pathway: Any relevance for the cardiovascular system?,” Can. J. Physiol. Pharmacol., pp. 1–11, Mar. 2019. [PubMed]",
      "A. D. Shaghiera, P. Widiyanti, and H. Yusuf, “Synthesis and Characterization of Injectable Hydrogels with Varying Collagen–Chitosan–Thymosin β4 Composition for Myocardial Infarction Therapy,” J. Funct. Biomater., vol. 9, no. 2, Mar. 2018. [PubMed]",
      "H.-J. Han, S. Kim, and J. Kwon, “Thymosin beta 4-Induced Autophagy Increases Cholinergic Signaling in PrP (106-126)-Treated HT22 Cells,” Neurotox. Res., Dec. 2018. [PubMed]",
      "Song, Ran & Choi, Hyun & Yang, Hyung-In & Yoo, Myung & Park, Yong-Beom & Kim, Kyoung. (2012). Association between serum thymosin β4 levels of rheumatoid arthritis patients and disease activity and response to therapy. Clinical rheumatology. 31. 1253-8. 10.1007/s10067-012-2011-7. [Research Gate]",
      "Philp, D., et al. “Thymosin β4 Promotes Angiogenesis, Wound Healing, and Hair Follicle Development.” Mechanisms of Ageing and Development, vol. 125, no. 2, Feb. 2004, pp. 113–115, 10.1016/j.mad.2003.11.005. [PubMed]"
    ],
    "articleAuthor": "Article Author\n\nThe above literature was researched, edited and organized by Dr. Logan, M.D. Dr. Logan holds a doctorate degree from Case Western Reserve University School of Medicine and a B.S. in molecular biology.",
    "scientificJournalAuthor": "Allan L. Goldstein, MD, Allan L. Goldstein is professor and Catharine B. & William McCormick Chair of the department of Biochemistry and Molecular Biology at The George Washington University School of Medicine and Health Sciences, where he has served since 1978. Thymosins were discovered in the mid 1960’s, when Allan Goldstein from the Laboratory of Abraham White at the Albert Einstein College of Medicine in New York studied the role of the thymus in development of the vertebrate immune system. He is a world-renowned authority on the thymus gland and the workings of the immune system, and co-discoverer of the thymosins. Dr. Goldstein is the author of over 400 scientific articles in professional journals, the inventor on more than 15 U.S. Patents, and the editor of several books in the fields of biochemistry, biomedicine, immunology and neuro-science. He is on the editorial boards of numerous scientific and medical journals and has been a consultant to many re-search organizations in industry and government; co-founder of The Institute for Advanced Studies in Aging and Geriatric Medicine, a non-profit research and educational institute; a member of the Board of Trustees of the Albert Sabin Vaccine Institute; and serves as the Chairman of the Board of RegeneRx Biopharmaceuticals. Dr. Goldstein received his B.S. from Wagner College in 1959 and his M.S. and Ph.D. from Rutgers University in 1964. He served as a faculty member of the Albert Einstein College of Medicine from 1964 to",
    "researchSections": [
      {
        "heading": "TB-500 (Thymosin Beta-4): Research Applications",
        "content": "TB-500 is used in research workflows to probe cytoskeleton-dependent phenotypes and signaling readouts in controlled laboratory settings. Common experimental contexts include:\n\nActin dynamics assays (G-actin sequestration, F-actin polymerization state, stress fiber organization)\nCell migration and adhesion phenotyping (scratch assays, transwell migration, focal adhesion remodeling)\nEndothelial biology and angiogenic signaling readouts (tube formation assays, VEGF-axis transcriptional endpoints)\nOxidative stress and innate signaling modules in cell systems (e.g., TLR-adaptor pathway readouts under defined stressors)\nNeural cell support and remodeling paradigms (glial lineage responses, neurite-associated morphology in preclinical models)\nHost-pathogen and adjunct biology paradigms in animal infection models (quantitative microbiology endpoints such as CFUs and inflammatory mediator readouts)"
      },
      {
        "heading": "TB-500 (Thymosin Beta-4): Preclinical Research Summary",
        "content": "1. Neural Tissue Models & Support-Cell Biology\n\nIn rat spinal cord injury models, thymosin β4 has been evaluated using histological, vascular, and functional/behavioral readouts, with study designs interrogating cellular responses in injured tissue and associated remodeling endpoints[1]. Review literature further discusses thymosin β4 within regenerative biology frameworks for neurological injury models, emphasizing mechanistic hypotheses and preclinical evidence streams rather than clinical translation[2].\n\nIn spinal cord–derived neural stem/progenitor cell models, thymosin beta 4 has been studied under oxidative-stress conditions with pathway-level readouts mapped to the TLR4/MyD88 axis, including changes in oxidative mediator levels and viability-associated measures in vitro[3].\n\n2. Vascular Biology, Angiogenic Signaling, and ECM Remodeling\n\nThymosin β4 has been reported as a modulator of angiogenic programs in preclinical systems, with literature describing relationships to VEGF-associated signaling and vascular development/remodeling endpoints[4]. Proposed mechanistic contexts include cell migration, ECM remodeling, and endothelial/pericyte-associated processes, evaluated using model-specific molecular and histologic readouts.\n\n3. Hair Follicle and Skin-Appendage Model Readouts\n\nMouse studies involving altered thymosin beta 4 expression have reported differences in hair follicle-associated phenotypes, and thymosin beta 4 has been evaluated for effects on stem-cell migration and differentiation readouts in these experimental contexts[5].\n\n4. Infection Models and Adjunct Biology with Antibiotics\n\nIn a mouse model of Pseudomonas aeruginosa-induced keratitis, thymosin beta 4 has been studied in combination with ciprofloxacin, with outcome measures including bacterial colony forming units (CFUs), neutrophil infiltration, and oxidative/inflammatory mediator readouts after defined treatment windows[6].\n\nA. Number of colony forming units (CFUs) of bacteria after 5 days of treatment. Note that none are detectable when ciprofloxicin is combined with TB-4.\nB. Shows number of neutrophils in the corneas of treated mice, an indication of inflammation.\nC. Measure of reactive oxygen species in corneas of mice after 5 days of treatment.\nD. Nitrate levels from corneal lysates.\nSource: PubMed\n\n5. Cardiovascular and Renal Model Systems\n\nLiterature has examined thymosin β4 and related pathway components in cardiovascular and renal model contexts, including angiogenic remodeling, endothelial migration phenotypes, inflammatory mediator profiles, and fibrosis-associated molecular markers, depending on the model and experimental endpoint selection[7]. Injectable hydrogel formulations incorporating collagen and thymosin β4 have been evaluated in myocardial ischemia-related experimental paradigms with readouts such as angiogenesis-associated markers and epicardial cell migration endpoints in preclinical designs[8].\n\n6. Neurodegeneration-Adjacent Cellular Models and Proteostasis\n\nIn HT22 cell experiments using prion peptide (PrP 106–126) exposure, thymosin beta 4 has been studied for effects on autophagy-associated pathways and signaling readouts under defined in vitro conditions[9].\n\n7. Summary\n\nAcross preclinical literature, TB-4/TB-500-related experimental work is commonly positioned around cytoskeletal regulation (actin monomer sequestration), migration-associated phenotypes, stress-response signaling, and tissue remodeling endpoints. Interpretation of outcomes is model-dependent and should be evaluated within each study’s dosing regimen, route, timecourse, and assay selection. This material is presented for scientific context and does not imply suitability for any non-laboratory purpose."
      }
    ]
  },
  "repair and recovery": {
    "title": "Repair and Recovery (60 Capsules) (Stable BPC-157 Arginate, Thymosin Beta-4 Fragment)",
    "citations": [
      "Song, Ran & Choi, Hyun & Yang, Hyung-In & Yoo, Myung & Park, Yong-Beom & Kim, Kyoung. (2012). Association between serum thymosin β4 levels of rheumatoid arthritis patients and disease activity and response to therapy. Clinical rheumatology. 31. 1253-8. 10.1007/s10067-012-2011-7. [Research Gate]"
    ],
    "articleAuthor": "Article Author\n\nThe above literature was researched, edited and organized by Dr. E. Logan, M.D. Dr. E. Logan holds a doctorate degree from Case Western Reserve University School of Medicine and a B.S. in molecular biology.",
    "scientificJournalAuthor": "Allan L. Goldstein, MD, Allan L. Goldstein is professor and Catharine B. & William McCormick Chair of the department of Biochemistry and Molecular Biology at The George Washington University School of Medicine and Health Sciences, where he has served since 1978. Thymosins were discovered in the mid 1960’s, when Allan Goldstein from the Laboratory of Abraham White at the Albert Einstein College of Medicine in New York studied the role of the thymus in development of the vertebrate immune system. He is a world-renowned authority on the thymus gland and the workings of the immune system, and co-discoverer of the thymosins. Dr. Goldstein is the author of over 400 scientific articles in professional journals, the inventor on more than 15 U.S. Patents, and the editor of several books in the fields of biochemistry, biomedicine, immunology and neuro-science. He is on the editorial boards of numerous scientific and medical journals and has been a consultant to many re-search organizations in industry and government; co-founder of The Institute for Advanced Studies in Aging and Geriatric Medicine, a non-profit research and educational institute; a member of the Board of Trustees of the Albert Sabin Vaccine Institute; and serves as the Chairman of the Board of RegeneRx Biopharmaceuticals. Dr. Goldstein received his B.S. from Wagner College in 1959 and his M.S. and Ph.D. from Rutgers University in 1964. He served as a faculty member of the Albert Einstein College of Medicine from 1964 to",
    "researchSections": [
      {
        "heading": "Research Applications",
        "content": "Actin dynamics and cytoskeletal turnover assays (e.g., actin polymerization state markers; motility indices)\nCell migration pathway studies in endothelial and fibroblast models (e.g., wound-scratch assays, transwell migration; signaling phosphorylation panels)\nExtracellular matrix organization and remodeling readouts (e.g., collagen-related transcriptional panels; matrix deposition quantification; histology in animal models)\nNitric oxide–associated signaling interrogation (e.g., NOS-linked markers, downstream pathway activation states)\nACE–substrate enzymology and peptide hydrolysis studies for Ac-SDKP (biochemical kinetics; structural binding context)\nSalt form and stability comparisons (arginate vs acetate) using forced-degradation and simulated matrix exposure protocols"
      },
      {
        "heading": "Preclinical Research Summary",
        "content": "Published animal and cellular studies involving BPC-157 commonly report pathway-level changes quantified by (i) connective tissue cell migration indices, (ii) fibroblast-associated transcriptional programs, (iii) extracellular matrix composition markers, and (iv) vascular-associated signaling panels. Experimental designs typically rely on histological scoring, immunohistochemistry, gene/protein expression profiling, and biochemical marker quantification.\n\nPreclinical investigations involving Ac-SDKP frequently evaluate endothelial signaling and migration readouts, fibroblast differentiation-state markers, and stress-response pathway activation states in defined stimulation models. In parallel, ACE-mediated hydrolysis of Ac-SDKP is studied using biochemical kinetics and structural characterization approaches, providing a mechanistic basis for interpreting Ac-SDKP availability in experimental systems.\n\nThe mechanistic literature often positions these peptides in adjacent experimental themes (cell motility, matrix organization, vascular-associated signaling). Combined evaluation, where performed, is interpreted through discrete molecular endpoints rather than organism-level functional claims.\n\nAc-SDKP (TB-500 Fragment)\n\n\nSequence: Ac-SDKP\nMolecular Formula: C20H33N5O9\nMolecular Weight: 487.5 g/mol\nPubChem CID: 65938\n\nSource: PubChem\n\n\nSalt-form discussions in the BPC-157 literature are typically framed around stability and degradation kinetics measured under controlled laboratory conditions (e.g., temperature stress, light exposure, and simulated matrix exposure). These experiments are used to compare analytical recovery and integrity of different salt forms under defined handling and assay workflows."
      },
      {
        "heading": "Ac-SDKP (Thymosin Beta4 Fragment) Oral Bioavailability Research Studies",
        "content": "Masuyer, Geoffrey, et al. “Structural Basis of Ac-SDKP Hydrolysis by Angiotensin-I Converting Enzyme.” Scientific Reports, vol. 5, no. 1, 25 Sept. 2015, 10.1038/srep13742.\nNakagawa, Pablo, et al. “Ac-SDKP Decreases Mortality and Cardiac Rupture after Acute Myocardial Infarction.” PloS One, vol. 13, no. 1, 2018, p. e0190300, pubmed.ncbi.nlm.nih.gov/29364896/, 10.1371/journal.pone.0190300.\nJin, Fuyu, et al. “Ac-SDKP Attenuates Activation of Lung Macrophages and Bone Osteoclasts in Rats Exposed to Silica by Inhibition of TLR4 and RANKL Signaling Pathways.” Journal of Inflammation Research, vol. 14, 2021, pp. 1647–1660, pubmed.ncbi.nlm.nih.gov/33948088/, 10.2147/JIR.S306883.\nXu, Hong, et al. “A New Antifibrotic Target of Ac-SDKP: Inhibition of Myofibroblast Differentiation in Rat Lung with Silicosis.” PLoS ONE, vol. 7, no. 7, 3 July 2012, p. e40301, 10.1371/journal.pone.0040301.\nSrivastava, Swayam Prakash, et al. “Inhibition of Angiotensin-Converting Enzyme Ameliorates Renal Fibrosis by Mitigating DPP-4 Level and Restoring Antifibrotic MicroRNAs.” Genes, vol. 11, no. 2, 18 Feb. 2020, p. E211, pubmed.ncbi.nlm.nih.gov/32085655/, 10.3390/genes11020211.\nShifeng, Li, et al. “Ac-SDKP Increases α-TAT 1 and Promotes the Apoptosis in Lung Fibroblasts and Epithelial Cells Double-Stimulated with TGF-β1 and Silica.” Toxicology and Applied Pharmacology, vol. 369, 15 Apr. 2019, pp. 17–29, www.sciencedirect.com/science/article/abs/pii/S0041008X19300729, 10.1016/j.taap.2019.02.015.\nKumar, Nitin, and Congcong Yin. “The Anti-Inflammatory Peptide Ac-SDKP: Synthesis, Role in ACE Inhibition, and Its Therapeutic Potential in Hypertension and Cardiovascular Diseases.” Pharmacological Research, vol. 134, Aug. 2018, pp. 268–279, 10.1016/j.phrs.2018.07.006.\nPeng, Hongmei, et al. “Ac-SDKP Inhibits Transforming Growth Factor-β1-Induced Differentiation of Human Cardiac Fibroblasts into Myofibroblasts.” American Journal of Physiology-Heart and Circulatory Physiology, vol. 298, no. 5, May 2010, pp. H1357–H1364, 10.1152/ajpheart.00464.2009.\nLi, Shifeng, et al. “[Inhibition Effect of N-Acetyl-Seryl-Aspartyl-Lysyl-Proline on Myofibroblast Differentiation of MRC-5 Human Fetal Lung Fibroblasts Inuced by Ang II].” Zhonghua Lao Dong Wei Sheng Zhi Ye Bing Za Zhi = Zhonghua Laodong Weisheng Zhiyebing Zazhi = Chinese Journal of Industrial Hygiene and Occupational Diseases, vol. 32, no. 11, 1 Nov. 2014, pp. 801–805, pubmed.ncbi.nlm.nih.gov/25579022/.\nXu, Hong, et al. “A New Antifibrotic Target of Ac-SDKP: Inhibition of Myofibroblast Differentiation in Rat Lung with Silicosis.” PLoS ONE, vol. 7, no. 7, 3 July 2012, p. e40301, 10.1371/journal.pone.0040301.\nSharma, Umesh C., et al. “A Small Peptide Ac-SDKP Inhibits Radiation-Induced Cardiomyopathy.” Circulation: Heart Failure, vol. 11, no. 8, Aug. 2018, 10.1161/circheartfailure.117.004867.\nCavasin, Maria A., et al. “Decreased Endogenous Levels of Ac-SDKP Promote Organ Fibrosis.” Hypertension, vol. 50, no. 1, July 2007, pp. 130–136, 10.1161/hypertensionaha.106.084103.\nKassem, Kamal M., et al. “Tβ4–Ac-SDKP Pathway: Any Relevance for the Cardiovascular System?” Canadian Journal of Physiology and Pharmacology, vol. 97, no. 7, 1 July 2019, pp. 589–599, www.ncbi.nlm.nih.gov/pmc/articles/PMC6824425/, 10.1139/cjpp-2018-0570.\n\nALL ARTICLES AND PRODUCT INFORMATION PROVIDED ON THIS WEBSITE ARE FOR INFORMATIONAL AND EDUCATIONAL PURPOSES ONLY.\n\nThe products offered on this website are furnished for in-vitro studies only. In-vitro studies (Latin: in glass) are performed outside of the body. These products are not medicines or drugs and have not been approved by the FDA to prevent, treat or cure any medical condition, ailment or disease. Bodily introduction of any kind into humans or animals is strictly forbidden by law."
      }
    ]
  },
  "epithalon": {
    "title": "Epithalon (Epitalon)",
    "citations": [
      "V. N. Anisimov, S. V. Mylnikov, and V. K. Khavinson, “Pineal peptide preparation epithalamin increases the lifespan of fruit flies, mice and rats,” Mech. Ageing Dev., vol. 103, no. 2, pp. 123–132, Jun. 1998. [PubMed]",
      "V. K. Khavinson, I. E. Bondarev, and A. A. Butyugov, “Epithalon peptide induces telomerase activity and telomere elongation in human somatic cells,” Bull. Exp. Biol. Med., vol. 135, no. 6, pp. 590–592, Jun. 2003. [PubMed]",
      "T. A. Dzhokhadze, T. Z. Buadze, M. N. Gaiozishvili, M. A. Rogava, and T. A. Lazhava, “[Functional regulation of genome with peptide bioregulators by hypertrophic cardiomyopathy (by patients and relatives)],” Georgian Med. News, no. 225, pp. 94–97, Dec. 2013. [PubMed]",
      "V. N. Anisimov et al., “Effect of Epitalon on biomarkers of aging, life span and spontaneous tumor incidence in female Swiss-derived SHR mice,” Biogerontology, vol. 4, no. 4, pp. 193–202, 2003. [PubMed]",
      "V. K. Khavinson, S. I. Tarnovskaya, N. S. Linkova, V. E. Pronyaeva, L. K. Shataeva, and P. P. Yakutseni, “Short cell-penetrating peptides: a model of interactions with gene promoter sites,” Bull. Exp. Biol. Med., vol. 154, no. 3, pp. 403–410, Jan. 2013. [PubMed]",
      "N. S. Lin’kova, B. I. Kuznik, and V. K. Khavinson, “[Peptide Ala-Glu-Asp-Gly and interferon gamma: their role in immune response during aging],” Adv. Gerontol. Uspekhi Gerontol., vol. 25, no. 3, pp. 478–482, 2012. [PubMed]",
      "N. I. Chalisova, N. S. Lin’kova, A. N. Zhekalov, A. O. Orlova, G. A. Ryzhak, and V. K. Khavinson, “[Short peptides stimulate skin cell regeneration during ageing],” Adv. Gerontol. Uspekhi Gerontol., vol. 27, no. 4, pp. 699–703, 2014. [PubMed]",
      "N. S. Lin’kova et al., “Peptide Regulation of Skin Fibroblast Functions during Their Aging In Vitro,” Bull. Exp. Biol. Med., vol. 161, no. 1, pp. 175–178, May 2016. [PubMed]",
      "I. A. Vinogradova, A. V. Bukalev, M. A. Zabezhinski, A. V. Semenchenko, V. K. Khavinson, and V. N. Anisimov, “Effect of Ala-Glu-Asp-Gly peptide on life span and development of spontaneous tumors in female rats exposed to different illumination regimes,” Bull. Exp. Biol. Med., vol. 144, no. 6, pp. 825–830, Dec. 2007. [PubMed]",
      "G. Kossoy, V. N. Anisimov, H. Ben-Hur, N. Kossoy, and I. Zusman, “Effect of the synthetic pineal peptide epitalon on spontaneous carcinogenesis in female C3H/He mice,” Vivo Athens Greece, vol. 20, no. 2, pp. 253–257, Apr. 2006. [PubMed]",
      "V. N. Anisimov et al., “Inhibitory effect of the peptide epitalon on the development of spontaneous mammary tumors in HER-2/neu transgenic mice,” Int. J. Cancer, vol. 101, no. 1, pp. 7–10, 2002. [PubMed]",
      "V. N. Anisimov, V. K. Khavinson, I. N. Alimova, A. V. Semchenko, and A. I. Yashin, “Epithalon decelerates aging and suppresses development of breast adenocarcinomas in transgenic her-2/neu mice,” Bull. Exp. Biol. Med., vol. 134, no. 2, pp. 187–190, Aug. 2002. [PubMed]",
      "I. A. Vinogradova, A. V. Bukalev, M. A. Zabezhinski, A. V. Semenchenko, V. K. Khavinson, and V. N. Anisimov, “Geroprotective effect of ala-glu-asp-gly peptide in male rats exposed to different illumination regimens,” Bull. Exp. Biol. Med., vol. 145, no. 4, pp. 472–477, Apr. 2008. [PubMed]",
      "S. Gery, N. Komatsu, L. Baldjyan, A. Yu, D. Koo, and H. P. Koeffler, “The circadian gene per1 plays an important role in cell growth and DNA damage control in human cancer cells,” Mol. Cell, vol. 22, no. 3, pp. 375–382, May 2006. [PubMed]",
      "V. K. Khavinson, L. K. Shataeva, and A. A. Chernova, “Effect of regulatory peptides on gene transcription,” Bull. Exp. Biol. Med., vol. 136, no. 3, pp. 288–290, Sep. 2003. [PubMed]",
      "O. V. Korkushko et al., “[Normalizing effect of the pineal gland peptides on the daily melatonin rhythm in old monkeys and elderly people],” Adv. Gerontol. Uspekhi Gerontol., vol. 20, no. 1, pp. 74–85, 2007. [PubMed]",
      "V. Khavinson, M. Razumovsky, S. Trofimova, R. Grigorian, and A. Razumovskaya, “Pineal-regulating tetrapeptide epitalon improves eye retina condition in retinitis pigmentosa,” Neuro Endocrinol. Lett., vol. 23, no. 4, pp. 365–368, Aug. 2002. [PubMed]"
    ],
    "articleAuthor": "Article Author\n\nThe above literature was researched, edited and organized by Dr. Logan, M.D. Dr. Logan holds a doctorate degree from Case Western Reserve University School of Medicine and a B.S. in molecular biology.",
    "scientificJournalAuthor": "",
    "researchSections": [
      {
        "heading": "Epithalon (Epitalon): Research Applications",
        "content": "Telomere biology and telomerase-associated enzymology: experimental systems measuring telomerase-associated activity, telomere length metrics, and downstream genome integrity endpoints in cell-based models.\nPeptide–DNA interaction studies: research evaluating interactions of short peptides with promoter regions and associated transcriptional modulation in cultured cells.\nTranscriptional regulation and gene-expression profiling: assays quantifying changes in expression for defined targets implicated in signaling, extracellular matrix biology, and protein biogenesis pathways.\nCircadian-linked molecular signaling: studies assessing transcriptional targets associated with rhythmic regulation and pineal-linked pathways, including AANAT and pCREB-associated signaling nodes.\nExtracellular matrix pathway research: fibroblast and connective-tissue model systems evaluating MMP2-linked endpoints and matrix remodeling biomarkers under controlled conditions.\nOncology model endpoints: exploratory rodent tumor and transgenic model studies evaluating tumor-associated metrics and molecular correlates as research outcomes.\nRetinal model readouts: rodent retinal degeneration models evaluating structural and electrophysiologic endpoints as experimental measures."
      },
      {
        "heading": "Epithalon (Epitalon): Preclinical Research Summary",
        "content": "1. Telomere-Associated Enzymology and Genome Integrity Readouts\n\nPreclinical investigations include insect and rodent studies evaluating survival curves and biomarker panels under defined experimental conditions [1]. Additional rodent work reports age-associated biomarker panels and tumor-incidence endpoints as measured outcomes in specified strains and study designs [4]. Separate cell-based studies describe telomerase-associated activity and telomere-length metrics as experimental readouts [2].\n\n2. Promoter-Interaction Modeling and Gene-Expression Endpoints\n\nCell culture studies have described short peptide interactions with promoter regions of selected genes as an experimental framework for transcriptional modulation and gene-expression profiling [5]. Additional rodent work reports interferon-gamma expression as a measured molecular endpoint in aging lymphocyte models under controlled experimental conditions [6].\n\n3. Fibroblast Function and Extracellular Matrix Pathway Biomarkers\n\nThe cited literature includes rodent and in vitro studies evaluating fibroblast functional state and extracellular matrix-associated endpoints, including MMP2-linked readouts and apoptosis-pathway markers such as caspase-3 activity in cultured fibroblast systems [7] [8].\n\n4. Tumor-Model Endpoints in Rodent and Transgenic Systems\n\nMultiple studies evaluate tumor-associated endpoints in rodent and transgenic models under defined illumination regimes or genetic backgrounds, including tumor development metrics and metastasis-related observations as experimental outcomes [9] [10] [11] [12] [13].\n\nSlowed tumor growth in mice exposed to epithalon compared to controls\nSource: Wiley Online Library\n\nMechanistic literature also evaluates circadian gene regulation in oncology-related cell systems, including PER1-associated signaling as a node linked to cell-cycle control and DNA damage response pathways in experimental models [14].\n\nPER1 Causes Increased Rates of Ionizing Radiation-Induced Cell Death\nSource: Molecular Cell\n\n5. Pineal-Linked Transcriptional Targets and Rhythmic Signaling Readouts\n\nStudies describe regulatory peptide effects on gene transcription, including attention to AANAT and pCREB-associated signaling as targets evaluated in rhythmic gene-expression paradigms [15]. The referenced literature also includes investigations in non-human primates evaluating daily secretion rhythm profiles as measured endpoints under specified study designs [16].\n\n6. Retinal Model Endpoints\n\nThe referenced literature includes rodent retinal degeneration models evaluating retina structural condition and electrophysiologic function as experimental endpoints under controlled conditions [17]."
      }
    ]
  },
  "follistatin 315": {
    "title": "Follistatin 315 1mg",
    "citations": [
      "F. F. Rose, V. B. Mattis, H. Rindt, and C. L. Lorson, “Delivery of recombinant follistatin lessens disease severity in a mouse model of spinal muscular atrophy,” Hum. Mol. Genet., vol. 18, no. 6, pp. 997–1005, Mar. 2009. [PubMed]",
      "A. Papaporfyriou et al., “Activin A and follistatin in patients with asthma. Does severity make the difference?,” Respirol. Carlton Vic, vol. 22, no. 3, pp. 473–479, 2017. [PubMed]",
      "C. L. Hardy et al., “The activin A antagonist follistatin inhibits asthmatic airway remodelling,” Thorax, vol. 68, no. 1, pp. 9–18, Jan. 2013. [PubMed]",
      "M. P. Hedger, W. R. Winnall, D. J. Phillips, and D. M. de Kretser, “The regulation and functions of activin and follistatin in inflammation and immunity,” Vitam. Horm., vol. 85, pp. 255–297, 2011. [PubMed]",
      "H. B. Forrester, D. M. de Kretser, T. Leong, J. Hagekyriakou, and C. N. Sprung, “Follistatin attenuates radiation-induced fibrosis in a murine model,” PLoS ONE, vol. 12, no. 3, Mar. 2017. [PubMed]",
      "F. Aoki, M. Kurabayashi, Y. Hasegawa, and I. Kojima, “Attenuation of bleomycin-induced pulmonary fibrosis by follistatin,” Am. J. Respir. Crit. Care Med., vol. 172, no. 6, pp. 713–720, Sep. 2005. [PubMed]",
      "S. Kelaini et al., “Follistatin-Like 3 Enhances the Function of Endothelial Cells Derived from Pluripotent Stem Cells by Facilitating β-Catenin Nuclear Translocation Through Inhibition of Glycogen Synthase Kinase-3β Activity,” Stem Cells Dayt. Ohio, vol. 36, no. 7, pp. 1033–1044, 2018. [PubMed]",
      "N. Mehta, A. L. Gava, D. Zhang, B. Gao, and J. Krepinsky, “Follistatin Protects against Glomerular Mesangial Cell Apoptosis and Oxidative Stress to Ameliorate Chronic Kidney Disease,” Antioxid. Redox Signal., Jun. 2019. [PubMed]",
      "S.-Y. Lee et al., “High circulating follistatin-like protein 1 as a biomarker of a metabolically unhealthy state,” Endocr. J., vol. 66, no. 3, pp. 241–251, Mar. 2019. [PubMed]",
      "C. Shen et al., “Protein Engineering on Human Recombinant Follistatin: Enhancing Pharmacokinetic Characteristics for Therapeutic Application,” J. Pharmacol. Exp. Ther., vol. 366, no. 2, pp. 291–302, Aug. 2018. [PubMed]",
      "D. D. Seachrist, S. T. Sizemore, E. Johnson, F. W. Abdul-Karim, K. L. Weber Bonk, and R. A. Keri, “Follistatin is a metastasis suppressor in a mouse model of HER2-positive breast cancer,” Breast Cancer Res. BCR, vol. 19, no. 1, p. 66, 05 2017. [PubMed]"
    ],
    "articleAuthor": "",
    "scientificJournalAuthor": "",
    "researchSections": [
      {
        "heading": "Research Applications",
        "content": "Investigation of activin sequestration and ligand–receptor availability\nModulation studies within TGF-β superfamily signaling networks\nExploration of extracellular matrix and tissue remodeling pathways\nEvaluation of signaling feedback loops in inflammatory and developmental models\nUse as a comparative reagent in isoform-specific follistatin research"
      },
      {
        "heading": "Preclinical Research Summary",
        "content": "Preclinical studies utilizing cellular and animal models have explored follistatin-associated modulation of developmental signaling, inflammatory regulation, vascular biology, and fibrotic processes. Genetic disruption and recombinant protein studies have provided insights into isoform-specific functions and tissue-dependent signaling outcomes.\n\nThese investigations contribute to foundational knowledge of activin-follistatin regulatory systems without implying translational or clinical application."
      }
    ]
  },
  "ghk-cu  copper peptide": {
    "title": "GHK-Cu 50mg Copper Peptide",
    "citations": [
      "A. Gruchlik, E. Chodurek, and Z. Dzierzewicz, “Effect of GLY-HIS-LYS and its copper complex on TGF-β secretion in normal human dermal fibroblasts,” Acta Pol. Pharm., vol. 71, no. 6, pp. 954–958, Dec. 2014. [PubMed]",
      "L. Pickart and A. Margolina, “Regenerative and Protective Actions of the GHK-Cu Peptide in the Light of the New Gene Data,” Int. J. Mol. Sci., vol. 19, no. 7, Jul. 2018. [PubMed]",
      "X. Wang et al., “GHK-Cu-liposomes accelerate scald wound healing in mice by promoting cell proliferation and angiogenesis,” Wound Repair Regen. Off. Publ. Wound Heal. Soc. Eur. Tissue Repair Soc., vol. 25, no. 2, pp. 270–278, 2017. [PubMed]",
      "G. D. Mulder et al., “Enhanced healing of ulcers in patients with diabetes by topical treatment with glycyl-l-histidyl-l-lysine copper,” Wound Repair Regen. Off. Publ. Wound Heal. Soc. Eur. Tissue Repair Soc., vol. 2, no. 4, pp. 259–269, Oct. 1994. [PubMed]",
      "S. O. Canapp et al., “The effect of topical tripeptide-copper complex on healing of ischemic open wounds,” Vet. Surg. VS, vol. 32, no. 6, pp. 515–523, Dec. 2003. [PubMed]",
      "L. Pickart, J. M. Vasquez-Soltero, and A. Margolina, “The Effect of the Human Peptide GHK on Gene Expression Relevant to Nervous System Function and Cognitive Decline,” Brain Sci., vol. 7, no. 2, Feb. 2017. [PubMed]",
      "H. Zhang, Y. Wang, and Z. He, “Glycine-Histidine-Lysine (GHK) Alleviates Neuronal Apoptosis Due to Intracerebral Hemorrhage via the miR-339-5p/VEGFA Pathway,” Front. Neurosci., vol. 12, p. 644, 2018. [PubMed]",
      "X.-M. Zhou et al., “GHK Peptide Inhibits Bleomycin-Induced Pulmonary Fibrosis in Mice by Suppressing TGFβ1/Smad-Mediated Epithelial-to-Mesenchymal Transition,” Front. Pharmacol., vol. 8, p. 904, 2017. [PubMed]",
      "J.-R. Park, H. Lee, S.-I. Kim, and S.-R. Yang, “The tri-peptide GHK-Cu complex ameliorates lipopolysaccharide-induced acute lung injury in mice,” Oncotarget, vol. 7, no. 36, pp. 58405–58417, Sep. 2016. [PubMed]",
      "L. А. Sever’yanova and D. V. Plotnikov, “Binding of Glyprolines to L-Arginine Inverts Its Analgesic and Antiagressogenic Effects,” Bull. Exp. Biol. Med., vol. 165, no. 5, pp. 621–624, Sep. 2018. [PubMed]"
    ],
    "articleAuthor": "Article Author\n\nThe above literature was researched, edited and organized by Dr. Logan, M.D. Dr. Logan holds a doctorate degree from Case Western Reserve University School of Medicine and a B.S. in molecular biology.",
    "scientificJournalAuthor": "Loren Pickart, Ph.D. has released 109 publications and is developing patents and analyzing GHK's effects on human gene expression of 4,192 genes. In addition to GHK's published potential uses on skin inflammation, metastatic cancer and COPD, it appears to have beneficial effects on other tissue systems such as the nervous system, gastrointestinal system, and mitochondrial system. His brief but detailed autobiography dives into the motivations and background behind his dedicating to skin, anti-aging, and life-long training.\n\nLoren Pickart, Ph.D is being referenced as one of the leading scientists involved in the research and development of GHK-Cu. In no way is this doctor/scientist endorsing or advocating the purchase, sale, or use of this product for any reason. There is no affiliation or relationship, implied or otherwise, between Peptide Sciences and this doctor. The purpose of citing the doctor is to acknowledge, recognize, and credit the exhaustive research and development efforts conducted by the scientists studying this peptide. Loren Pickart, Ph.D is listed in [1] [3] and [8] under the",
    "researchSections": [
      {
        "heading": "GHK-Cu: Research Applications",
        "content": "GHK-Cu is widely utilized in laboratory research to investigate fibroblast migration, immune-cell recruitment, angiogenic signaling, and extracellular matrix synthesis. Experimental systems include dermal fibroblast cultures, endothelial cell assays, neuronal regeneration models, and controlled animal studies.\n\nAdditional applications include investigation of oxidative stress modulation, antimicrobial peptide interactions, stem-cell–associated signaling markers, and transcriptional responses related to tissue regeneration under controlled experimental conditions."
      },
      {
        "heading": "GHK-Cu: Preclinical Research Summary",
        "content": "Preclinical investigations of GHK-Cu include in-vitro fibroblast and keratinocyte models, neuronal regeneration assays, antimicrobial interaction studies, and multiple in-vivo animal models of tissue injury and inflammation.\n\nExperimental observations report enhanced cellular migration, increased extracellular matrix deposition, modulation of inflammatory mediators, and altered gene-expression patterns associated with regeneration and stress response. These findings are presented solely as laboratory observations without implication of clinical, cosmetic, or therapeutic outcomes."
      }
    ]
  },
  "melanotan 2": {
    "title": "Melanotan 2 (MT2) (3mg x 10 Vials = 30mg)",
    "citations": [
      "E. Minakova et al., “Melanotan-II reverses autistic features in a maternal immune activation mouse model of autism,” PLoS ONE, vol. 14, no. 1, Jan. 2019. [PubMed]",
      "A. van der Klaauw et al., “Role of melanocortin signaling in the preference for dietary macronutrients in human beings,” Lancet Lond. Engl., vol. 385 Suppl 1, p. S12, Feb. 2015. [PubMed]",
      "H. Shimizu, K. Inoue, and M. Mori, “The leptin-dependent and -independent melanocortin signaling system: regulation of feeding and energy expenditure,” J. Endocrinol., vol. 193, no. 1, pp. 1–9, Apr. 2007. [Research Gate]",
      "C. Bjørbaek and A. N. Hollenberg, “Leptin and melanocortin signaling in the hypothalamus,” Vitam. Horm., vol. 65, pp. 281–311, 2002. [PubMed]",
      "F. Guo, K. Bakal, Y. Minokoshi, and A. N. Hollenberg, “Leptin Signaling Targets the Thyrotropin-Releasing Hormone Gene Promoter in Vivo,” Endocrinology, vol. 145, no. 5, pp. 2221–2227, May 2004. [PubMed]",
      "Y. H. Lee, M.-Y. Wang, X.-X. Yu, and R. H. Unger, “Glucagon is the key factor in the development of diabetes,” Diabetologia, vol. 59, no. 7, pp. 1372–1375, 2016. [PubMed]",
      "C. Toda et al., “Distinct effects of leptin and a melanocortin receptor agonist injected into medial hypothalamic nuclei on glucose uptake in peripheral tissues,” Diabetes, vol. 58, no. 12, pp. 2757–2765, Dec. 2009. [PubMed]",
      "D. A. York, S. Boghossian, and M. Park-York, “Melanocortin activity in the amygdala influences alcohol intake,” Pharmacol. Biochem. Behav., vol. 98, no. 1, pp. 112–119, Mar. 2011. [PubMed]",
      "M. Navarro, F. Carvajal, J. M. Lerma-Cabrera, I. Cubero, M. J. Picker, and T. E. Thiele, “Evidence that Melanocortin Receptor Agonist Melanotan-II Synergistically Augments the Ability of Naltrexone to Blunt Binge-Like Ethanol Intake in Male C57BL/6J Mice,” Alcohol. Clin. Exp. Res., vol. 39, no. 8, pp. 1425–1433, Aug. 2015. [PubMed]",
      "M. T. Islam et al., “Vasopressin neurons in the paraventricular hypothalamus promote wakefulness via lateral hypothalamic orexin neurons,” Curr. Biol. CB, pp. S0960-9822(22)01121–6, Jul. 2022, doi: 10.1016/j.cub.2022.07.020. [PubMed]",
      "J. K. Y. Lau et al., “Melanocortin receptor activation alleviates amyloid pathology and glial reactivity in an Alzheimer’s disease transgenic mouse model,” Sci. Rep., vol. 11, no. 1, p. 4359, Feb. 2021, doi: 10.1038/s41598-021-83932-4. [PubMed]"
    ],
    "articleAuthor": "Article Author\n\nThe above literature was researched, edited and organized by Dr. Logan, M.D. Dr. Logan holds a doctorate degree from Case Western Reserve University School of Medicine and a B.S. in molecular biology.",
    "scientificJournalAuthor": "Dr. Wessells is a UW professor, chair of the Department of Urology, and has served on several national and international professional and government committees, including the WHO International Consultations on Erectile and Sexual Dysfunction, an NIDDK working group on urological complications of diabetes, and a NIH symposium on diabetes. He is a surgeon, researcher and expert on urogenital trauma and erectile dysfunction. His clinical interests include reconstructive surgery of the genitourinary tract, acute injury management and complex surgery for male sexual dysfunction.  His research interests are in urogenital trauma epidemiology and management; the physiology and pathophysiology of erectile dysfunction; reconstructive surgery; crash injury mechanics; and urological complications of diabetes. A proerectile melanocortin agonist developed by Dr. Wessells and his collaborators at the University of Arizona is in clinical trials for the treatment of erectile dysfunction.\n\nDr. Wessells is being referenced as one of the leading scientists involved in the research and development of Melanotan 2. In no way is this doctor/scientist endorsing or advocating the purchase, sale, or use of this product for any reason. There is no affiliation or relationship, implied or otherwise, between Peptide Sciences and this doctor. The purpose of citing the doctor is to acknowledge, recognize, and credit the exhaustive research and development efforts conducted by the scientists studying this pep",
    "researchSections": [
      {
        "heading": "Melanotan 2 (MT2): Research Applications",
        "content": "MT-2 is used in research environments to study melanocortin receptor activation across multiple tissue types and neural circuits. Experimental applications include investigation of receptor-specific signaling bias, ligand–receptor affinity profiles, and downstream transcriptional responses mediated by melanocortin receptor subtypes.\n\nAdditional research contexts include analysis of neuroendocrine signaling networks, hypothalamic peptide integration, and receptor-driven modulation of intracellular signaling pathways in rodent and cellular model systems."
      },
      {
        "heading": "Melanotan 2 (MT2): Preclinical Research Summary",
        "content": "Preclinical investigations utilizing MT-2 have explored melanocortin receptor signaling in rodent behavioral paradigms, neuroendocrine circuits, and metabolic signaling networks. These studies are used to map receptor distribution, signal propagation, and receptor-specific pathway engagement at molecular and cellular resolution.\n\nAdditional experimental literature evaluates MT-2-associated modulation of hypothalamic signaling nodes, limbic system activity, and central peptide integration using in-vivo animal models and in-vitro neuronal culture systems. Findings are interpreted within a mechanistic framework without translational inference."
      }
    ]
  },
  "mots-c": {
    "title": "MOTS-c",
    "citations": [
      "H. Lu et al., “MOTS-c peptide regulates adipose homeostasis to prevent ovariectomy-induced metabolic dysfunction,” J. Mol. Med. Berl. Ger., vol. 97, no. 4, pp. 473–485, Apr. 2019. [PubMed]",
      "S.-J. Kim et al., “The mitochondrial-derived peptide MOTS-c is a regulator of plasma metabolites and enhances insulin sensitivity,” Physiol. Rep., vol. 7, no. 13, p. e14171, Jul. 2019. [PubMed]",
      "L. R. Cataldo, R. Fernández-Verdejo, J. L. Santos, and J. E. Galgani, “Plasma MOTS-c levels are associated with insulin sensitivity in lean but not in obese individuals,” J. Investig. Med., vol. 66, no. 6, pp. 1019–1022, Aug. 2018. [PubMed]",
      "N. Che et al., “MOTS-c improves osteoporosis by promoting the synthesis of type I collagen in osteoblasts via TGF-β/SMAD signaling pathway,” Eur. Rev. Med. Pharmacol. Sci., vol. 23, no. 8, pp. 3183–3189, Apr. 2019. [PubMed]",
      "B.-T. Hu and W.-Z. Chen, “MOTS-c improves osteoporosis by promoting osteogenic differentiation of bone marrow mesenchymal stem cells via TGF-β/Smad pathway,” Eur. Rev. Med. Pharmacol. Sci., vol. 22, no. 21, pp. 7156–7163, Nov. 2018. [PubMed]",
      "N. Fuku et al., “The mitochondrial-derived peptide MOTS-c: A player in exceptional longevity?,” Aging Cell, vol. 14, Aug. 2015. [Research Gate]",
      "Q. Qin et al., “Downregulation of circulating MOTS-c levels in patients with coronary endothelial dysfunction,” Int. J. Cardiol., vol. 254, pp. 23–27, 01 2018. [PubMed]",
      "Y. Yang et al., “The role of mitochondria-derived peptides in cardiovascular disease: Recent updates,” Biomed. Pharmacother. Biomedecine Pharmacother., vol. 117, p. 109075, Jun. 2019. [PubMed]"
    ],
    "articleAuthor": "Article Author\n\nThe above literature was researched, edited and organized by Dr. Logan, M.D. Dr. Logan holds a doctorate degree from Case Western Reserve University School of Medicine and a B.S. in molecular biology.",
    "scientificJournalAuthor": "Dr. Changhan David Lee, contributor to “MOTS-c: A novel mitochondrial-derived peptide regulating muscle and fat metabolism,” and “The Mitochondrial-Encoded Peptide MOTS-c Translocates to the Nucleus to Regulate Nuclear Gene Expression in Response to Metabolic Stress,” is a researcher at the School of Gerontology at USC Leonard Davis.\n\nPinchas Cohen, MD, is the dean of the USC Leonard Davis School of Gerontology, executive director of the Ethel Percy Andrus Gerontology Center, and holder of the William and Sylvia Kugel Dean’s Chair in Gerontology. He is an expert in the study of mitochondrial peptides and their possible therapeutic benefits for diabetes, Alzheimer’s, and other diseases related to aging. Cohen’s current research focus is on the emerging science of mitochondria-derived peptides, which he discovered. These peptides include humanin, a 24-amino acid peptide encoded from the mt-16S-rRNA. It is a novel, centrally acting insulin sensitizer and metaboloprotective factor representing a new therapeutic and diagnostic target in diabetes and related disease. Other mitochondrial peptides of interest include MOTS-c, a second peptide encoded from a small ORF in the 12S region of the mitochondrial chromosome that has potent anti-diabetes and anti-obesity effect and acts as an exercise-mimetic, and SHLP2, a peptide encoded from the light strand of the mt-16S-rRNA region whose levels correlate with prostate cancer.\n\nDr. Changhan David Lee and Dr. Pinchas Cohen are being referenc",
    "researchSections": [
      {
        "heading": "MOTS-c: Research Applications",
        "content": "In the scientific literature, MOTS-c has been referenced in non-clinical research involving cellular assays and animal model studies. These publications describe experimental contexts in which molecular interactions, signaling components, and pathway-associated markers were observed and recorded.\n\nReported research contexts include examination of:\n\nMitochondrial signaling-associated molecular components\nNuclear translocation phenomena under experimental conditions\nAMPK-associated signaling elements\nMetabolic pathway–related molecular markers\nGene expression patterns evaluated in cellular and animal models\n\nAll reported applications are confined to descriptive investigation within controlled laboratory research environments."
      },
      {
        "heading": "MOTS-c: Preclinical Research Summary",
        "content": "Preclinical studies cited in the scientific literature describe observations involving MOTS-c in cellular and animal model systems. Reported observations include measurements of signaling-associated proteins, metabolite profiles, and gene expression markers recorded under defined experimental conditions.\n\nAdditional publications describe associations between MOTS-c and molecular features observed in experimental models of metabolic stress and mitochondrial perturbation. All reported findings are restricted to the experimental systems employed."
      }
    ]
  },
  "n-acetyl semax amidate": {
    "title": "N-Acetyl Semax Amidate 30mg",
    "citations": [
      "I. S. Lebedeva et al., “Effects of Semax on the Default Mode Network of the Brain,” Bull. Exp. Biol. Med., vol. 165, no. 5, pp. 653–656, Sep. 2018. [PubMed]",
      "E. V. Medvedeva et al., “The peptide semax affects the expression of genes related to the immune and vascular systems in rat brain focal ischemia: genome-wide transcriptional analysis,” BMC Genomics, vol. 15, p. 228, Mar. 2014. [PubMed]",
      "E. I. Gusev, M. Y. Martynov, E. V. Kostenko, L. V. Petrova, and S. N. Bobyreva, “[The efficacy of semax in the tretament of patients at different stages of ischemic stroke],” Zh. Nevrol. Psikhiatr. Im. S. S. Korsakova, vol. 118, no. 3. Vyp. 2, pp. 61–68, 2018. [PubMed]",
      "T. I. Agapova et al., “[Effect of semax on the temporary dynamics of brain-derived neurotrophic factor and nerve growth factor gene expression in the rat hippocampus and frontal cortex],” Mol. Genet. Mikrobiol. Virusol., no. 3, pp. 28–32, 2008. [PubMed]",
      "M. H. Scantlebury, K.-C. Chun, S.-C. Ma, J. M. Rho, and D. Y. Kim, “Adrenocorticotropic Hormone Protects Learning and Memory Function in Epileptic Kcna1-null mice,” Neurosci. Lett., vol. 645, pp. 14–18, Apr. 2017. [PubMed]",
      "T. Deltheil et al., “Behavioral and serotonergic consequences of decreasing or increasing hippocampus brain-derived neurotrophic factor protein levels in mice,” Neuropharmacology, vol. 55, no. 6, pp. 1006–1014, Nov. 2008. [PubMed]",
      "Ivanov, Alexander & Bobyntsev, Igor & Shepeleva, Olga & Kryukov, Alexey & Andreeva, L & Myasoedov, N. (2017). Influence of ACTG4-7-PGP (Semax) on Morphofunctional State of Hepatocytes in Chronic Emotional and Painful Stress. Bulletin of experimental biology and medicine. 163. [Research Gate]",
      "Bobyntsev, Igor & Kryukov, Alexey & Shepeleva, Olga & Ivanov, Alexander. (2015). The effect of ACTH-4-7-PGP peptide on lipid peroxidation in liver and activity of serum transaminases in rats under acute and chronic immobilization stress conditions. 78. 18-21. [Research Gate]"
    ],
    "articleAuthor": "Article Author\n\nThe above literature was researched, edited and organized by Dr. Logan, M.D. Dr. Logan holds a doctorate degree from Case Western Reserve University School of Medicine and a B.S. in molecular biology.",
    "scientificJournalAuthor": "Dr. Igor Ivanovich Bobyntsev researches at the Kursk State Medical University within the Department of Pathophysiology. His main goal is to find new, more effective methods for teaching morphological disciplines… such as histology, cytology, embryology, human anatomy, pathological anatomy, the study of the morphological manifestation of stress-limiting effects of neuropeptides and their synthetic analogues. His key interests pertain to Antioxidants, Free Radicals, Antioxidant Activity, Free Radical Scavengers, Reactive Oxygen Species, Lipid Peroxidation, SOD, Oxidative Stress Biomarkers, Inflammatory Biomarkers, and Oxidative Stress. He specifically studied the influence of Semax on the morphofunctional state of hepatocytes, and lipid peroxidation in the liver, when under chronic emotional and painful stress.\n\nDr. Igor Ivanovich Bobyntsev is being referenced as one of the leading scientists involved in the research and development of Semax. In no way is this doctor/scientist endorsing or advocating the purchase, sale, or use of this product for any reason. There is no affiliation or relationship, implied or otherwise, between Peptide Sciences and this doctor. The purpose of citing the doctor is to acknowledge, recognize, and credit the exhaustive research and development efforts conducted by the scientists studying this peptide. Dr. Igor Ivanovich Bobyntsev is listed in [8] and [9] under the",
    "researchSections": [
      {
        "heading": "Research Applications",
        "content": "N-Acetyl Semax is used in preclinical research settings to examine peptide-driven modulation of molecular and transcriptional networks. Common laboratory applications include:\n\nGene expression analysis in neural tissue following peptide exposure\nInvestigation of signaling pathways associated with neurotrophic factor regulation\nAssessment of vascular- and immune-related transcriptional responses in animal models\nExploration of peptide effects on mitochondrial and oxidative-stress–related pathways"
      },
      {
        "heading": "Preclinical Research Summary",
        "content": "Preclinical investigations of N-Acetyl Semax primarily involve in vivo rodent models and in vitro molecular assays. Published studies describe time-dependent changes in gene expression within the hippocampus, frontal cortex, and vascular-associated tissues. These data sets are used to characterize transcriptional dynamics and pathway-level responses following peptide exposure.\n\nAdditional studies evaluate N-Acetyl Semax as a research tool for examining relationships between neurotrophic factor signaling and cellular adaptation under experimentally induced stress conditions."
      }
    ]
  },
  "selank": {
    "title": "Selank 10mg",
    "citations": [
      "A. Volkova et al., “Selank Administration Affects the Expression of Some Genes Involved in GABAergic Neurotransmission,” Front. Pharmacol., vol. 7, Feb. 2016. [PubMed]",
      "A. A. Zozulya et al., “The inhibitory effect of Selank on enkephalin-degrading enzymes as a possible mechanism of its anxiolytic activity,” Bull. Exp. Biol. Med., vol. 131, no. 4, pp. 315–317, Apr. 2001. [PubMed]",
      "O. Y. Sokolov, V. K. Meshavkin, N. V. Kost, and A. A. Zozulya, “Effects of Selank on behavioral reactions and activities of plasma enkephalin-degrading enzymes in mice with different phenotypes of emotional and stress reactions,” Bull. Exp. Biol. Med. [PubMed]",
      "O. N. Uchakina et al., “[Immunomodulatory effects of selank in patients with anxiety-asthenic disorders],” Zh. Nevrol. Psikhiatr. Im. S. S. Korsakova, vol. 108, no. 5, pp. 71–75, 2008. [PubMed]",
      "A. A. Zozulia et al., “[Efficacy and possible mechanisms of action of a new peptide anxiolytic selank in the therapy of generalized anxiety disorders and neurasthenia],” Zh. Nevrol. Psikhiatr. Im. S. S. Korsakova, vol. 108, no. 4, pp. 38–48, 2008. [PubMed]",
      "T. Kolomin, M. Shadrina, L. Andreeva, P. Slominsky, S. Limborska, and N. Myasoedov, “Expression of inflammation-related genes in mouse spleen under tuftsin analog Selank,” Regul. Pept., vol. 170, no. 1–3, pp. 18–23, Oct. 2011. [PubMed]",
      "T. I. Agapova et al., “[Effect of semax on the temporary dynamics of brain-derived neurotrophic factor and nerve growth factor gene expression in the rat hippocampus and frontal cortex],” Mol. Genet. Mikrobiol. Virusol., no. 3, pp. 28–32, 2008. [PubMed]",
      "T. P. Semenova, I. I. Kozlovskiĭ, N. M. Zakharova, and M. M. Kozlovskaia, “[Experimental optimization of learning and memory processes by selank],” Eksp. Klin. Farmakol., vol. 73, no. 8, pp. 2–5, Aug. 2010. [PubMed]",
      "T. P. Semenova, M. M. Kozlovskaya, N. M. Zakharova, I. I. Kozlovskii, and A. V. Zuikov, “Effect of selank on cognitive processes after damage inflicted to the cerebral catecholamine system during early ontogeny,” Bull. Exp. Biol. Med., vol. 144, no. [PubMed]"
    ],
    "articleAuthor": "Article Author\n\nThe above literature was researched, edited and organized by Dr. Logan, M.D. Dr. Logan holds a doctorate degree from Case Western Reserve University School of Medicine and a B.S. in molecular biology.",
    "scientificJournalAuthor": "Dr. Petr Slominsky's 169 research works with 803 citations. 12 of those papers pertain to the examination of Selank’s diverse, multifaceted effects e.g. anxiety reduction, changes in the transcription profile of the hippocampus, and changes in expression of the genes for chemokines, cytokines, and their receptors. Dr. Slominsky is particularly interested in the epigenetic effects of Selank and other disease-state pathologies.\n\nDr. Petr Slominsky is being referenced as one of the leading scientists involved in the research and development of Selank. In no way is this doctor/scientist endorsing or advocating the purchase, sale, or use of this product for any reason. There is no affiliation or relationship, implied or otherwise, between Peptide Sciences and this doctor. The purpose of citing the doctor is to acknowledge, recognize, and credit the exhaustive research and development efforts conducted by the scientists studying this peptide. Dr. Petr Slominsky is listed in [7] under the",
    "researchSections": [
      {
        "heading": "Selank: Research Applications",
        "content": "Selank is utilized in preclinical research environments to examine peptide-driven modulation of molecular signaling networks. Common experimental applications include:\n\nGene expression profiling related to neurotransmitter-associated pathways\nInvestigation of GABAergic signaling components in rodent neural tissue\nAnalysis of enkephalin-degrading enzyme activity in biochemical assays\nImmune-related gene transcription studies involving cytokines and chemokines\nEvaluation of peptide stability and receptor-associated signaling dynamics"
      },
      {
        "heading": "Selank: Preclinical Research Summary",
        "content": "Preclinical studies involving Selank have primarily utilized rodent models and in vitro biochemical systems. Published data describe changes in transcriptional profiles of neural and immune tissues, including genes associated with inflammatory signaling, neurotransmitter receptor modulation, and stress-responsive pathways.\n\nAnimal-based experiments have further evaluated Selank as a tool for studying peptide-mediated regulation of gene networks involved in neuroimmune communication. These investigations emphasize pathway-level observations rather than organism-level outcomes."
      }
    ]
  },
  "semax": {
    "title": "Semax 30mg",
    "citations": [
      "I. S. Lebedeva et al., “Effects of Semax on the Default Mode Network of the Brain,” Bull. Exp. Biol. Med., vol. 165, no. 5, pp. 653–656, Sep. 2018. [PubMed]",
      "E. V. Medvedeva et al., “The peptide semax affects the expression of genes related to the immune and vascular systems in rat brain focal ischemia: genome-wide transcriptional analysis,” BMC Genomics, vol. 15, p. 228, Mar. 2014. [PubMed]",
      "E. I. Gusev, M. Y. Martynov, E. V. Kostenko, L. V. Petrova, and S. N. Bobyreva, “[The efficacy of semax in the tretament of patients at different stages of ischemic stroke],” Zh. Nevrol. Psikhiatr. Im. S. S. Korsakova, vol. 118, no. 3. Vyp. 2, pp. 61–68, 2018. [PubMed]",
      "T. I. Agapova et al., “[Effect of semax on the temporary dynamics of brain-derived neurotrophic factor and nerve growth factor gene expression in the rat hippocampus and frontal cortex],” Mol. Genet. Mikrobiol. Virusol., no. 3, pp. 28–32, 2008. [PubMed]",
      "M. H. Scantlebury, K.-C. Chun, S.-C. Ma, J. M. Rho, and D. Y. Kim, “Adrenocorticotropic Hormone Protects Learning and Memory Function in Epileptic Kcna1-null mice,” Neurosci. Lett., vol. 645, pp. 14–18, Apr. 2017. [PubMed]",
      "T. Deltheil et al., “Behavioral and serotonergic consequences of decreasing or increasing hippocampus brain-derived neurotrophic factor protein levels in mice,” Neuropharmacology, vol. 55, no. 6, pp. 1006–1014, Nov. 2008. [PubMed]",
      "Ivanov, Alexander & Bobyntsev, Igor & Shepeleva, Olga & Kryukov, Alexey & Andreeva, L & Myasoedov, N. (2017). Influence of ACTG4-7-PGP (Semax) on Morphofunctional State of Hepatocytes in Chronic Emotional and Painful Stress. Bulletin of experimental biology and medicine. 163. [Research Gate]",
      "Bobyntsev, Igor & Kryukov, Alexey & Shepeleva, Olga & Ivanov, Alexander. (2015). The effect of ACTH-4-7-PGP peptide on lipid peroxidation in liver and activity of serum transaminases in rats under acute and chronic immobilization stress conditions. 78. 18-21. [Research Gate]"
    ],
    "articleAuthor": "Article Author\n\nThe above literature was researched, edited and organized by Dr. Logan, M.D. Dr. Logan holds a doctorate degree from Case Western Reserve University School of Medicine and a B.S. in molecular biology.",
    "scientificJournalAuthor": "Dr. Igor Ivanovich Bobyntsev researches at the Kursk State Medical University within the Department of Pathophysiology. His main goal is to find new, more effective methods for teaching morphological disciplines… such as histology, cytology, embryology, human anatomy, pathological anatomy, the study of the morphological manifestation of stress-limiting effects of neuropeptides and their synthetic analogues. His key interests pertain to Antioxidants, Free Radicals, Antioxidant Activity, Free Radical Scavengers, Reactive Oxygen Species, Lipid Peroxidation, SOD, Oxidative Stress Biomarkers, Inflammatory Biomarkers, and Oxidative Stress. He specifically studied the influence of Semax on the morphofunctional state of hepatocytes, and lipid peroxidation in the liver, when under chronic emotional and painful stress.\n\nDr. Igor Ivanovich Bobyntsev is being referenced as one of the leading scientists involved in the research and development of Semax. In no way is this doctor/scientist endorsing or advocating the purchase, sale, or use of this product for any reason. There is no affiliation or relationship, implied or otherwise, between Peptide Sciences and this doctor. The purpose of citing the doctor is to acknowledge, recognize, and credit the exhaustive research and development efforts conducted by the scientists studying this peptide. Dr. Igor Ivanovich Bobyntsev is listed in [8] and [9] under the",
    "researchSections": [
      {
        "heading": "Research Applications",
        "content": "Semax is a synthetic analogue of an ACTH fragment, corresponding to amino acids 4–10 of ACTH with a C-terminal Pro-Gly-Pro motif. In laboratory research, Semax is used in preclinical models to probe pathway-level regulation of:\n\nNeurotrophin-linked transcription: experimental readouts involving BDNF and NGF gene-expression dynamics in CNS-relevant regions [5].\nSystems-level brain network activity: research imaging endpoints assessing resting-state network behavior and connectivity patterns [1].\nNeurovascular and immune-associated gene programs: genome-wide transcriptional profiling in animal models with emphasis on vascular-system and immune-system gene sets in brain tissue [3].\nLearning/memory model endpoints: mechanistic comparisons using ACTH-related peptides in rodent genetic models with cognition-focused behavioral readouts [6].\nMonoaminergic signaling markers: studies of serotonergic pathway measures and neurotrophin-dependent behavioral paradigms in rodents [7].\nOxidative stress biomarker panels: liver-associated morphofunctional and lipid peroxidation endpoints under stress-model conditions [8] [9]."
      },
      {
        "heading": "Preclinical Research Summary",
        "content": "Pathway / Mechanistic Context\n\nAcross cited preclinical literature, Semax is evaluated as a modulator of gene-expression programs and systems-level neural network activity. Reported endpoints include transcriptomic changes in CNS tissue, neurotrophin-associated transcriptional dynamics, and network-level activity patterns measured by experimental neuroimaging approaches. In addition, publications describe Semax-associated shifts in peripheral oxidative stress biomarker panels and hepatic tissue readouts under stress-model conditions.\n\n1. Resting-State Network Readouts\n\nExperimental imaging work reports changes in resting-state network behavior after Semax exposure, including measured effects on the default mode network as defined within that study’s analytic framework [1]. Background literature on default mode and social-cognition network relationships is commonly used to interpret these kinds of resting-state measures in neuroscience research [2].\n\nImage showing the overlap of activation between the resting mode network and parts of the brain responsible social cognition.\nSource: PubMed\n\n2. Genome-Wide Transcriptional Profiling in a Rodent Ischemia Model\n\nIn a rat model of focal brain ischemia, genome-wide transcriptional analysis reported Semax-associated changes in expression across immune- and vascular-system related gene sets in brain tissue, providing a molecular context for mechanistic investigation of neurovascular and inflammatory pathway regulation in this model [3].\n\n3. Neurotrophin-Related Gene Expression Dynamics\n\nRodent studies report that Semax exposure is associated with time-dependent gene expression changes in the hippocampus and frontal cortex, including reported effects on BDNF and NGF gene-expression measures within the study design [5].\n\n4. ACTH-Related Peptides in a Genetic Epilepsy Model\n\nPreclinical work in a Kcna1-null mouse model reports that ACTH exposure is associated with preservation of learning and memory readouts in the experimental paradigm, providing comparative context for research on ACTH-derived peptide fragments such as Semax [6].\n\n5. Serotonergic and Neurotrophin-Linked Behavioral Paradigms\n\nRodent studies evaluating altered hippocampal BDNF levels report behavioral and serotonergic consequences in experimental models, supporting broader mechanistic frameworks that connect neurotrophin abundance, serotonergic pathway markers, and behavioral outputs in preclinical research [7].\n\n6. Peripheral Oxidative Stress and Hepatic Biomarker Readouts\n\nAdditional cited studies describe Semax-associated effects on hepatic morphofunctional endpoints and lipid peroxidation markers in rat stress-model conditions, including biochemical measures relevant to oxidative stress research workflows [8] [9]."
      }
    ]
  },
  "trh thyrotropin": {
    "title": "TRH Thyrotropin (Protirelin)",
    "citations": [
      "L. B. Marangell et al., “Effects of intrathecal thyrotropin-releasing hormone (protirelin) in refractory depressed patients,” Arch. Gen. Psychiatry, vol. 54, no. 3, pp. 214–222, Mar. 1997. [PubMed]",
      "R. Bunevicius and V. Matulevicius, “Short-lasting behavioural effects of thyrotropin-releasing hormone in depressed women: results of placebo-controlled study,” Psychoneuroendocrinology, vol. 18, no. 5–6, pp. 445–449, 1993. [PubMed]",
      "A. M. Callahan et al., “Comparative antidepressant effects of intravenous and intrathecal thyrotropin-releasing hormone: confounding effects of tolerance and implications for therapeutics,” Biol. Psychiatry, vol. 41, no. 3, pp. 264–272, Feb. 1997. [PubMed]",
      "M. P. Szuba et al., “Rapid antidepressant response after nocturnal TRH administration,” J. Clin. Psychopharmacol. [PubMed]",
      "M. Watanave et al., “Contribution of Thyrotropin-Releasing Hormone to Cerebellar Long-Term Depression and Motor Learning,” Front. Cell. Neurosci., 2018. [PubMed]",
      "N. Shibusawa et al., “Thyrotropin-releasing hormone (TRH) in the cerebellum,” Cerebellum, 2008. [PubMed]",
      "J. D. Boghosian et al., “Intravenous and Intratracheal Thyrotropin Releasing Hormone…,” J. Pharmacol. Exp. Ther., 2018. [PubMed]",
      "H. Asai et al., “Reversal of hemorrhagic shock in rats…,” J. Recept. Signal Transduct. Res., 2011. [PubMed]",
      "E. Fliers et al., “Decreased hypothalamic thyrotropin-releasing hormone gene expression…,” J. Clin. Endocrinol. Metab., 1997. [PubMed]",
      "W. Pierpaoli, “Aging-reversing properties of thyrotropin-releasing hormone,” Curr. Aging Sci., 2013. [PubMed]",
      "A. M. Mellow et al., “Acute effects of high-dose thyrotropin releasing hormone infusions in Alzheimer’s disease,” Psychopharmacology, 1989. [PubMed]",
      "L. Luo et al., “Thyrotropin releasing hormone (TRH) in the hippocampus of Alzheimer patients,” J. Alzheimers Dis., 2002. [PubMed]"
    ],
    "articleAuthor": "Article Author\n\nThe above literature was researched, edited and organized by Dr. Logan, M.D. Dr. Logan holds a doctorate degree from Case Western Reserve University School of Medicine and a B.S. in molecular biology.",
    "scientificJournalAuthor": "Prof. Walter Pierpaoli was born in 1934 in Milan. He graduated with honors in Medicine and Surgery in 1960. After a major in Cardiology and a period as Assistant Hospital and practical activity (Medical Office), taught as an Assistant at the Institute of General Pathology, University of Milan, conducting research in biophysics (photodynamic effect) and taking advantage of a scholarship of the Atomic Energy Commission of the United States. Prof. Pierpaoli promoted first by many years the medical interdisciplinary now called \"Neuroimmunomodulation\", to which now devote thousands of researchers. He devised, based on his original research, interventions against diseases of aging and is conducting for many years in Seattle, in the United States, with a group of researchers at the well-known Fred Hutchinson Cancer Research Center, research started in 1978 and based on a new method of transplants that can modify the immune system and prevent the organ rejection. This project, protected by worldwide patents, is in a very advanced stage of development and will provide the first clinical internships widespread pathologies, including diabetes and cancer. Prof. Pierpaoli has published over 140 scientific papers experimental, published in the best scientific journals such as Nature, (7 items), the Journal of the National Cancer Institute - USA, Proceedings of the National Academy of Sciences - USA and many others.\n\nNotable achievements:\n\nFounded the Stromboli Conference on Aging and Cance",
    "researchSections": [
      {
        "heading": "TRH Thyrotropin (Protirelin): Research Applications",
        "content": "Neuroendocrine signaling models: TRH is used as a probe for hypothalamic–pituitary axis circuitry, TRHR pharmacology, and hormone-release pathway mapping in cell-based, ex vivo, and in vivo animal systems.\nCerebellar synaptic plasticity: TRH has been studied as a modulatory input in rodent models investigating cerebellar long-term depression (LTD) and associated motor-learning phenotypes.\nAutonomic network physiology: In rodent preparations, TRH has been evaluated for effects on integrative brainstem outputs, including experimentally measured respiratory and cardiovascular parameters.\nAnalog comparison studies: TRH is frequently benchmarked against metabolically stabilized analogs (e.g., taltirelin) to evaluate duration-of-action and signaling persistence in preclinical assay systems."
      },
      {
        "heading": "TRH Thyrotropin (Protirelin): Preclinical Research Summary",
        "content": "Cerebellar LTD and motor learning (rodent models): Genetic and experimental paradigms have been used to evaluate the contribution of TRH signaling to cerebellar LTD and performance across repeated motor task trials in mice[5].\n\nKnockout mice treated with TRH learned much faster after four trials, with time before falling from rotating rod being nearly twice that of untreated mice. This shows improved rates of motor learning\nSource: PubMed\n\nRespiratory physiology (anesthetized rat preparations): TRH and TRH analogs have been assessed in rodent paradigms quantifying ventilation under pharmacologically induced respiratory depression[7].\n\nHemodynamic stress models (rat hemorrhage): Metabolically stabilized TRH analogs (e.g., taltirelin) have been examined in acute rat models measuring arterial pressure, respiratory parameters, and blood gas/acid–base indices following controlled hemorrhage[8].\n\nNeuroanatomical/circuit context: Reviews summarize TRH localization, receptor distribution, and proposed neuromodulatory roles in cerebellar and broader CNS networks relevant to plasticity and motor coordination research[6]."
      }
    ]
  },
  "bpc-157, tb-500": {
    "title": "BPC-157, TB-500 (Blend)",
    "citations": [
      "Song, Ran & Choi, Hyun & Yang, Hyung-In & Yoo, Myung & Park, Yong-Beom & Kim, Kyoung. (2012). Association between serum thymosin β4 levels of rheumatoid arthritis patients and disease activity and response to therapy. Clinical rheumatology. 31. 1253-8. 10.1007/s10067-012-2011-7. [Research Gate]",
      "Philp, D., et al. “Thymosin β4 Promotes Angiogenesis, Wound Healing, and Hair Follicle Development.” Mechanisms of Ageing and Development, vol. 125, no. 2, Feb. 2004, pp. 113–115, 10.1016/j.mad.2003.11.005. [PubMed]"
    ],
    "articleAuthor": "",
    "scientificJournalAuthor": "Allan L. Goldstein, MD, Allan L. Goldstein is professor and Catharine B. & William McCormick Chair of the department of Biochemistry and Molecular Biology at The George Washington University School of Medicine and Health Sciences, where he has served since 1978. Thymosins were discovered in the mid 1960’s, when Allan Goldstein from the Laboratory of Abraham White at the Albert Einstein College of Medicine in New York studied the role of the thymus in development of the vertebrate immune system. He is a world-renowned authority on the thymus gland and the workings of the immune system, and co-discoverer of the thymosins. Dr. Goldstein is the author of over 400 scientific articles in professional journals, the inventor on more than 15 U.S. Patents, and the editor of several books in the fields of biochemistry, biomedicine, immunology and neuro-science. He is on the editorial boards of numerous scientific and medical journals and has been a consultant to many re-search organizations in industry and government; co-founder of The Institute for Advanced Studies in Aging and Geriatric Medicine, a non-profit research and educational institute; a member of the Board of Trustees of the Albert Sabin Vaccine Institute; and serves as the Chairman of the Board of RegeneRx Biopharmaceuticals. Dr. Goldstein received his B.S. from Wagner College in 1959 and his M.S. and Ph.D. from Rutgers University in 1964. He served as a faculty member of the Albert Einstein College of Medicine from 1964 to",
    "researchSections": [
      {
        "heading": "BPC-157, TB-500 Blend: Research Applications",
        "content": "The combined study of BPC-157 and TB-500 is primarily relevant to research questions where cell recruitment, migration, and coordinated remodeling are limiting factors. Example research contexts include:\n\nWound repair models requiring fibroblast migration, extracellular matrix deposition, and remodeling\nTendon/ligament repair models focused on cell survival, outgrowth, and restoration of tissue organization[1]\nFibrosis and remodeling research where thymosin beta-4–related pathways are of interest[2]\nAngiogenesis-associated repair questions (e.g., vascular support as a rate limiter in tissue regeneration)[5]\n\nBecause “synergy” is an outcome claim that must be demonstrated experimentally, this page frames synergy as a hypothesis: if BPC-157 and TB-500 affect different bottlenecks in repair (gene expression vs. cytoskeletal mobilization, for example), combined administration in preclinical designs may produce additive or multiplicative improvements in migration speed, wound closure kinetics, tissue organization, or histologic markers of remodeling—depending on model choice and endpoints."
      },
      {
        "heading": "BPC-157, TB-500 Blend: Preclinical Research Summary",
        "content": "The primary evidence base referenced here consists of: (1) tendon-oriented work linking BPC-157 to outgrowth, survival, and migration processes relevant to repair[1], and (2) thymosin beta-4 literature discussing pathway-level roles in remodeling and fibrosis-related biology[2], as well as angiogenesis and wound healing contexts[5].\n\nFrom these sources, a reasonable preclinical summary is:\n\nBPC-157: associated with tissue repair behaviors that include cell survival and migration in tendon-focused models[1].\nThymosin beta-4/TB-500 context: discussed in relation to fibrosis/remodeling pathways and repair-associated angiogenesis across multiple research domains[2], [5].\nIntersection concept: migration and remodeling biology (actin-driven movement + repair-program signaling) provides a mechanistic bridge for combination testing.\n\nBecause “synergy” is a higher bar than “overlap,” rigorous evaluation typically requires combination arms vs. single-peptide arms, standardized injury models, and predefined endpoints (migration assays, histology, collagen organization, vascular markers, inflammatory markers, and functional recovery metrics)."
      }
    ]
  },
  "cjc-1295, ghrp-2": {
    "title": "CJC-1295 (no DAC), GHRP-2 10mg (Blend)",
    "citations": [
      "M. Ionescu and L. A. Frohman, “Pulsatile secretion of growth hormone (GH) persists during continuous stimulation by CJC-1295, a long-acting GH-releasing hormone analog,” J. Clin. Endocrinol. Metab., vol. 91, no. 12, pp. 4792–4797, Dec. 2006. [PubMed]",
      "D. Yamamoto et al., “GHRP-2, a GHS-R agonist, directly acts on myocytes to attenuate the dexamethasone-induced expressions of muscle-specific ubiquitin ligases, Atrogin-1 and MuRF1,” Life Sci., vol. 82, no. 9–10, pp. 460–466, Feb. 2008. [PubMed]",
      "V. Bodart et al., “Identification and characterization of a new growth hormone-releasing peptide receptor in the heart,” Circ. Res., vol. 85, no. 9, pp. 796–802, Oct. 1999. [PubMed]",
      "D. D. Taub, W. J. Murphy, and D. L. Longo, “Rejuvenation of the aging thymus: growth hormone-mediated and ghrelin-mediated signaling pathways,” Curr. Opin. Pharmacol., vol. 10, no. 4, pp. 408–424, Aug. 2010. [PubMed]",
      "S. L. Teichman, A. Neale, B. Lawrence, C. Gagnon, J.-P. Castaigne, and L. A. Frohman, “Prolonged stimulation of growth hormone (GH) and insulin-like growth factor I secretion by CJC-1295, a long-acting analog of GH-releasing hormone, in healthy adults,” J. Clin. Endocrinol. Metab., vol. 91, no. 3, pp. 799–805, Mar. 2006. [PubMed]",
      "Jetté, Lucie & Leger, Roger & Thibaudeau, Karen & Benquet, Corinne & Robitaille, Martin & Pellerin, Isabelle & Paradis, Véronique & Wyk, Pieter & Pham, Khan & Bridon, Dominique. (2005). hGRF1-29-Albumin Bioconjugates Activate the GRF Receptor on the Anterior Pituitary in Rats: Identification of CJC-1295 as a Long Lasting GRF Analog. [Research Gate]"
    ],
    "articleAuthor": "",
    "scientificJournalAuthor": "Dr. Dominique Bridon holds a Master of Science, Chemical Engineering and Polymer Sciences from Ecole Nationale Supérieure de Chimie and a PhD in Organic Chemistry from the University of Paris XI, ICSN, Orsay, France with Nobel Laureate Sir Derek H. R. Barton as Research Advisor. He completed his Post-Doctoral Research at the University of California, Berkeley. He studied the potential of CJC-1295 as a long lasting GRF analog and also held various leadership positions involving peptide research and technologies at Ipsen, Conjuchem, Redcell, and Abbott Laboratories. Dr. Bridon has served as a Director for Enobia (acquired by Alexion) and Neuronax and as a member of the Scientific Advisory Board of Syntaxin (acquired by Ipsen) and Biosortia. He now brings 30 years of executive and scientific leadership experience to the Epivax Oncology team.\n\nDr. Dominique Bridon is being referenced as one of the leading scientists involved in the research and development of CJC-1295. In no way is this doctor/scientist endorsing or advocating the purchase, sale, or use of this product for any reason. There is no affiliation or relationship, implied or otherwise, between Peptide Sciences and this doctor. The purpose of citing the doctor is to acknowledge, recognize, and credit the exhaustive research and development efforts conducted by the scientists studying this peptide. Dr. Dominique Bridon is listed in [7] under the",
    "researchSections": [
      {
        "heading": "Research Applications",
        "content": "This peptide blend is used in preclinical research to examine pulsatile GH secretion patterns, receptor activation timing, and coordination between GHRH and GHSR signaling pathways. Experimental systems include isolated pituitary tissues and animal models utilized to study endocrine signal integration.\n\nAdditional applications include investigation of downstream signaling events, transcriptional regulation, and second-messenger dynamics associated with somatotroph cell activation under controlled laboratory conditions."
      },
      {
        "heading": "Preclinical Research Summary",
        "content": "Published preclinical studies involving GHRH analogues and GHSR agonists have examined GH secretion dynamics, receptor activity, and associated molecular markers in animal models. Observations are reported within controlled laboratory environments.\n\nAll findings are interpreted strictly within the scope of basic research and do not imply any clinical, diagnostic, or applied outcomes."
      }
    ]
  },
  "cjc-1295, ghrp-6": {
    "title": "CJC-1295 (no DAC), GHRP-6 10mg (Blend)",
    "citations": [
      "[1] M. Ionescu and L. A. Frohman, “Pulsatile secretion of growth hormone (GH) persists during continuous stimulation by CJC-1295, a long-acting GH-releasing hormone analog,” J. Clin. Endocrinol. Metab., vol. 91, no. 12, pp. 4792–4797, Dec. 2006. [PubMed]",
      "[2] S. L. Teichman, A. Neale, B. Lawrence, C. Gagnon, J.-P. Castaigne, and L. A. Frohman, “Prolonged stimulation of growth hormone (GH) and insulin-like growth factor I secretion by CJC-1295, a long-acting analog of GH-releasing hormone, in healthy adults,” J. Clin. Endocrinol. Metab., vol. 91, no. 3, pp. 799–805, Mar. 2006. [PubMed]",
      "[4] M. Fernández-Mayola et al., “Growth hormone-releasing peptide 6 prevents cutaneous hypertrophic scarring: early mechanistic data from a proteome study,” Int. Wound J., vol. 15, no. 4, pp. 538–546, Aug. 2018. [PubMed]",
      "[5] H.-J. Huang et al., “The protective effects of Ghrelin/GHSR on hippocampal neurogenesis in CUMS mice,” Neuropharmacology, May 2019. [PubMed]",
      "[6] N. Subirós et al., “Assessment of dose-effect and therapeutic time window in preclinical studies of rhEGF and GHRP-6 coadministration for stroke therapy,” Neurol. Res., vol. 38, no. 3, pp. 187–195, Mar. 2016. [PubMed]",
      "[7] Korbonits, Marta, and Ashley B. Grossman. “Growth Hormone-Releasing Peptide and Its Analogues.” Trends in Endocrinology & Metabolism, vol. 6, no. 2, Mar. 1995, pp. 43–49 [PubMed]"
    ],
    "articleAuthor": "",
    "scientificJournalAuthor": "Márta Korbonits graduated in Medicine in Budapest and undertook her early clinical training at the Internal Medicine Department of the Postgraduate Medical School, Budapest. She joined the Department of Endocrinology at St. Bartholomew’s Hospital under the mentorship of Professors Ashley Grossman and Michael Besser. Her MD and later PhD studies contributed to the understanding of the effects of growth hormone secretagogues on hypothalamic hormone release and the nature and causes of pituitary tumorigenesis. She was awarded an MRC Clinician Scientist Fellowship and commenced studies that produced novel insights into ghrelin physiology and genetics. Her findings related to the regulation of the metabolic enzyme AMPK by ghrelin, cannabinoid and glucocorticoid opened a new aspect of hormonal regulation of metabolism. In 2008, Márta Korbonits was promoted to Professor of Endocrinology and Metabolism and since 2012, has led the Centre of Endocrinology at Barts and the London School of Medicine. In 2016, Márta Korbonits was appointed a Deputy Head of the William Harvey Research Institute. Professor Korbonits continues to integrate human studies alongside with laboratory-based research and has pioneered several projects in translational medicine.\n\nMárta Korbonits is being referenced as one of the leading scientists involved in the research and development of GHRP-6. In no way is this doctor/scientist endorsing or advocating the purchase, sale, or use of this product for any reason. T",
    "researchSections": [
      {
        "heading": "Research Applications",
        "content": "This blend is used in preclinical research designs focused on:\nComparative analysis of GHRHR vs. GHSR-1a receptor activation and downstream signaling output\nCharacterization of pulsatile endocrine signaling patterns and receptor cross-talk in pituitary-derived tissues\nInvestigation of growth hormone axis feedback regulation and downstream insulin-like growth factor (IGF) pathway markers in animal models\nIn-vitro receptor binding, second messenger (cAMP and Ca2+) assays, and signal transduction profiling under controlled conditions"
      },
      {
        "heading": "Preclinical Research Summary",
        "content": "Published research has evaluated GHRH analogs and growth hormone secretagogues in non-clinical systems to characterize pulsatile growth hormone secretion, receptor selectivity, and endocrine signaling dynamics. Studies have examined persistence of pulsatile secretion during sustained GHRH analog stimulation as well as mechanistic outcomes associated with ghrelin receptor activation in cellular and animal models. All findings referenced for these peptide classes are derived from preclinical research contexts and are used to inform mechanistic hypotheses and experimental design."
      }
    ]
  },
  "cjc-1295, hexarelin": {
    "title": "CJC-1295 (no DAC), Hexarelin 10mg (Blend)",
    "citations": [
      "X. Zhang, L. Qu, L. Chen, and C. Chen, “Improvement of cardiomyocyte function by in vivo hexarelin treatment in streptozotocin-induced diabetic rats,” Physiol. Rep., vol. 6, no. 4, 2018. [PubMed]",
      "J. Huang, Y. Li, J. Zhang, Y. Liu, and Q. Lu, “The Growth Hormone Secretagogue Hexarelin Protects Rat Cardiomyocytes From in vivo Ischemia/Reperfusion Injury Through Interleukin-1 Signaling Pathway,” Int. Heart. J., vol. 58, no. 2, pp. 257–263, Apr. 2017. [PubMed]",
      "R. Mosa et al., “Hexarelin, a Growth Hormone Secretagogue, Improves Lipid Metabolic Aberrations in Nonobese Insulin-Resistant Male MKR Mice,” Endocrinology, vol. 158, no. 10, pp. 3174–3187, 01 2017. [PubMed]",
      "E. Conte et al., “Growth hormone secretagogues prevent dysregulation of skeletal muscle calcium homeostasis in a rat model of cisplatin-induced cachexia,” J. Cachexia Sarcopenia Muscle, vol. 8, no. 3, pp. 386–404, Jun. 2017. [PubMed]",
      "X. Zhang, L. Qu, L. Chen, and C. Chen, “Improvement of cardiomyocyte function by in vivo hexarelin treatment in streptozotocin-induced diabetic rats,” Physiol. Rep., vol. 6, no. 4, 2018. [PubMed]",
      "Torsello, Antonio & Bresciani, Elena & Tamiazzo, Laura & Bulgarelli, Ilaria & Caporali, Simona & Moulin, Aline & Fehrentz, jean-alain & Martinez, Jean & Perissoud, Daniel & Locatelli, Vittorio. (2008). Novel potent and selective non-peptide ligands of ghrelin receptor : characterization of endocrine and extraendocrine actions. [Research Gate]"
    ],
    "articleAuthor": "",
    "scientificJournalAuthor": "Aline Moulin’s research contributions include studies involving ghrelin receptor pharmacology and evaluation of compounds for their capacity to modulate hexarelin-associated signaling readouts in experimental systems. Her work spans development and characterization efforts relevant to receptor ligand profiling, quality frameworks, and research operations across multiple scientific settings.\n\nAline Moulin is referenced solely to acknowledge scientific contributions in this field. No endorsement, affiliation, or advocacy is implied. Aline Moulin is listed in [8] under the",
    "researchSections": [
      {
        "heading": "Research Applications",
        "content": "Experimental applications for Hexarelin + CJC-1295 co-administration designs include:\nCharacterization of pituitary receptor cross-talk and endocrine pulsatility under dual-receptor stimulation\nSignal transduction profiling in cell-based assays (e.g., cAMP readouts, Ca2+ flux, MAPK/ERK pathway activation)\nPreclinical evaluation of tissue-specific receptor expression and downstream molecular responses in cardiovascular and metabolic research models"
      },
      {
        "heading": "Preclinical Research Summary",
        "content": "Non-clinical studies have investigated hexarelin in cardiovascular research models, including rodent and murine ischemia/reperfusion paradigms and diabetic model systems, with emphasis on cardiomyocyte signaling, inflammatory mediator pathways, and intracellular calcium regulation[1]–[3]. Additional animal studies have examined hexarelin-associated alterations in lipid metabolism markers within insulin-resistant model systems[4]. Separate preclinical investigations have explored growth hormone secretagogues, including hexarelin, in skeletal muscle models evaluating mitochondrial integrity and calcium homeostasis under chemotherapy-associated stress paradigms in rodents[5], [6]. All referenced findings are derived from laboratory and animal research settings and are used to inform mechanistic hypotheses."
      }
    ]
  },
  "fragment, cjc-1295, ipamorelin": {
    "title": "Fragment, CJC-1295 (no DAC), Ipamorelin 12mg (Blend)",
    "citations": [
      "M. Heffernan et al., “The Effects of Human GH and Its Lipolytic Fragment (AOD9604) on Lipid Metabolism Following Chronic Treatment in Obese Mice andβ 3-AR Knock-Out Mice,” Endocrinology, vol. 142, no. 12, pp. 5182–5189, Dec. 2001. [PubMed]",
      "R. Ferrer-Lorente, C. Cabot, J.-A. Fernández-López, and M. Alemany, “Combined effects of oleoyl-estrone and a beta3-adrenergic agonist (CL316,243) on lipid stores of diet-induced overweight male Wistar rats,” Life Sci., vol. 77, no. 16, pp. 2051–2058, Sep. 2005. [PubMed]",
      "F. M. Ng, J. Sun, L. Sharma, R. Libinaka, W. J. Jiang, and R. Gianello, “Metabolic studies of a synthetic lipolytic domain (AOD9604) of human growth hormone,” Horm. Res., vol. 53, no. 6, pp. 274–278, 2000. [PubMed]",
      "M. C. Van Hout and E. Hearne, “Netnography of Female Use of the Synthetic Growth Hormone CJC-1295: Pulses and Potions,” Subst. Use Misuse, vol. 51, no. 1, pp. 73–84, Jan. 2016. [PubMed]",
      "K. Raun et al., “Ipamorelin, the first selective growth hormone secretagogue,” Eur. J. Endocrinol., vol. 139, no. 5, pp. 552–561, Nov. 1998. [PubMed]",
      "E. Adeghate and A. S. Ponery, “Mechanism of ipamorelin-evoked insulin release from the pancreas of normal and diabetic rats,” Neuro Endocrinol. Lett., vol. 25, no. 6, pp. 403–406, Dec. 2004. [PubMed]",
      "J. Svensson et al., “The GH secretagogues ipamorelin and GH-releasing peptide-6 increase bone mineral content in adult female rats,” J. Endocrinol., vol. 165, no. 3, pp. 569–577, Jun. 2000. [PubMed]",
      "M. Alba et al., “Once-daily administration of CJC-1295, a long-acting growth hormone-releasing hormone (GHRH) analog, normalizes growth in the GHRH knockout mouse,” Am. J. Physiol. Endocrinol. Metab., vol. 291, no. 6, pp. E1290-1294, Dec. 2006. [PubMed]",
      "M. Ionescu and L. A. Frohman, “Pulsatile secretion of growth hormone (GH) persists during continuous stimulation by CJC-1295, a long-acting GH-releasing hormone analog,” J. Clin. Endocrinol. Metab., vol. 91, no. 12, pp. 4792–4797, Dec. 2006. [PubMed]",
      "Jetté, Lucie & Leger, Roger & Thibaudeau, Karen & Benquet, Corinne & Robitaille, Martin & Pellerin, Isabelle & Paradis, Véronique & Wyk, Pieter & Pham, Khan & Bridon, Dominique. (2005). hGRF1-29-Albumin Bioconjugates Activate the GRF Receptor on the Anterior Pituitary in Rats: Identification of CJC-1295 as a Long Lasting GRF Analog. [Research Gate]"
    ],
    "articleAuthor": "",
    "scientificJournalAuthor": "Dr. Dominique Bridon holds a Master of Science, Chemical Engineering and Polymer Sciences from Ecole Nationale Supérieure de Chimie and a PhD in Organic Chemistry from the University of Paris XI, ICSN, Orsay, France with Nobel Laureate Sir Derek H. R. Barton as Research Advisor. He completed his Post-Doctoral Research at the University of California, Berkeley. He studied the potential of CJC-1295 as a long lasting GRF analog and also held various leadership positions involving peptide research and technologies at Ipsen, Conjuchem, Redcell, and Abbott Laboratories. Dr. Bridon has served as a Director for Enobia (acquired by Alexion) and Neuronax and as a member of the Scientific Advisory Board of Syntaxin (acquired by Ipsen) and Biosortia. He now brings 30 years of executive and scientific leadership experience to the Epivax Oncology team.\n\nDr. Dominique Bridon is being referenced as one of the leading scientists involved in the research and development of CJC-1295. In no way is this doctor/scientist endorsing or advocating the purchase, sale, or use of this product for any reason. There is no affiliation or relationship, implied or otherwise, between Peptide Sciences and this doctor. The purpose of citing the doctor is to acknowledge, recognize, and credit the exhaustive research and development efforts conducted by the scientists studying this peptide. Dr. Dominique Bridon is listed in [10] under the",
    "researchSections": [
      {
        "heading": "Research Applications",
        "content": "In preclinical research, Fragment 176–191 is studied for its role in adipocyte lipid metabolism, energy partitioning, and regulation of lipolytic signaling pathways. Investigations focus on adipose tissue–specific responses independent of classical growth hormone receptor activation."
      },
      {
        "heading": "Research Applications",
        "content": "This peptide is utilized in laboratory research to examine hypothalamic–pituitary signaling, growth hormone release kinetics, receptor responsiveness, and downstream insulin-like growth factor (IGF) pathway modulation in preclinical models."
      },
      {
        "heading": "Research Applications",
        "content": "Ipamorelin is employed in preclinical studies to evaluate ghrelin receptor–dependent signaling, intracellular calcium mobilization, phospholipase C activation, and selective modulation of growth hormone secretagogue pathways in animal and cellular models."
      },
      {
        "heading": "Preclinical Research Summary",
        "content": "Preclinical studies involving these peptides have examined endocrine pulsatility, receptor selectivity, adipocyte metabolism, skeletal matrix markers, and feedback regulation within growth hormone–associated pathways. All findings referenced in the scientific literature are derived exclusively from cellular assays and animal models and are intended to advance mechanistic and biochemical understanding."
      }
    ]
  },
  "fragment, modified grf, ipamorelin": {
    "title": "Fragment, Modified GRF, Ipamorelin 12mg (Blend)",
    "citations": [
      "T. Ito et al., “GI side-effects of a possible therapeutic GRF analogue in monkeys are likely due to VIP receptor agonist activity,” Peptides, vol. 22, no. 7, pp. 1139–1151, Jul. 2001. [PubMed]",
      "M. Waelbroeck, P. Robberecht, D. H. Coy, J.-C. Camus, P. D. Neef, and J. Christophe, “Interaction of Growth Hormone-Releasing Factor (GRF) and 14 GRF Analogs with Vasoactive Intestinal Peptide (VIP) Receptors of Rat Pancreas. Discovery of (N-Ac-Tyr1,D-Phe2)-GRF(l-29)-NH2 as a VIP Antagonist,” Endocrinology, vol. 116, no. 6, pp. 2643–2649, Jun. 1985. [PubMed]",
      "A. V. Schally, X. Zhang, R. Cai, J. M. Hare, R. Granata, and M. Bartoli, “Actions and potential therapeutic applications of growth hormone-releasing hormone agonists,” Endocrinology. [PubMed]",
      "N. B. Andersen, K. Malmlöf, P. B. Johansen, T. T. Andreassen, G. Ørtoft, and H. Oxlund, “The growth hormone secretagogue ipamorelin counteracts glucocorticoid-induced decrease in bone formation of adult rats,” Growth Horm. IGF Res. Off. J. Growth Horm. Res. Soc. Int. IGF Res. Soc., vol. 11, no. 5, pp. 266–272, Oct. 2001. [PubMed]",
      "Svensson et al., “The GH secretagogues ipamorelin and GH-releasing peptide-6 increase bone mineral content in adult female rats,” J. Endocrinol., vol. 165, no. 3, pp. 569–577, Jun. 2000. [PubMed]",
      "M. Heffernan et al., “The Effects of Human GH and Its Lipolytic Fragment (AOD9604) on Lipid Metabolism Following Chronic Treatment in Obese Mice andβ 3-AR Knock-Out Mice,” Endocrinology, vol. 142, no. 12, pp. 5182–5189, Dec. 2001. [PubMed]",
      "R. Ferrer-Lorente, C. Cabot, J.-A. Fernández-López, and M. Alemany, “Combined effects of oleoyl-estrone and a beta3-adrenergic agonist (CL316,243) on lipid stores of diet-induced overweight male Wistar rats,” Life Sci., vol. 77, no. 16, pp. 2051–2058, Sep. 2005. [PubMed]",
      "F. M. Ng, J. Sun, L. Sharma, R. Libinaka, W. J. Jiang, and R. Gianello, “Metabolic studies of a synthetic lipolytic domain (AOD9604) of human growth hormone,” Horm. Res., vol. 53, no. 6, pp. 274–278, 2000. [PubMed]"
    ],
    "articleAuthor": "",
    "scientificJournalAuthor": "Dr. Jan Izdebski has been listed as a noteworthy Chemist, researcher by Marquis Who's Who. He attained a Master of Science from University Warsaw, Poland, 1959 and is a Doctor of Philosophy, University Warsaw, Poland, 1965, along with a Doctor of Science, University Warsaw, Poland, 1979. He studied how GRF 1-29 is more resistant to enzymatic degradation and how that affects its half-life.\n\nDr. Jan Izdebski is being referenced as one of the leading scientists involved in the research and development of GRF 1-29. In no way is this doctor/scientist endorsing or advocating the purchase, sale, or use of this product for any reason. There is no affiliation or relationship, implied or otherwise, between Peptide Sciences and this doctor. The purpose of citing the doctor is to acknowledge, recognize, and credit the exhaustive research and development efforts conducted by the scientists studying this peptide. Dr. Jan Izdebski is listed in [9] under the",
    "researchSections": []
  },
  "mod grf, ghrp-2": {
    "title": "Mod GRF, GHRP-2 10mg (Blend)",
    "citations": [
      "[1] M. Waelbroeck, P. Robberecht, D. H. Coy, J.-C. Camus, P. D. Neef, and J. Christophe, “Interaction of Growth Hormone-Releasing Factor (GRF) and 14 GRF Analogs with Vasoactive Intestinal Peptide (VIP) Receptors of Rat Pancreas. Discovery of (N-Ac-Tyr1,D-Phe2)-GRF(l-29)-NH2 as a VIP Antagonist,” Endocrinology, vol. 116, no. 6, pp. 2643–2649, Jun. 1985. [PubMed]",
      "[2] A. V. Schally, X. Zhang, R. Cai, J. M. Hare, R. Granata, and M. Bartoli, “Actions and potential therapeutic applications of growth hormone-releasing hormone agonists,” Endocrinology. [PubMed]",
      "[3] E. Adeghate and A. S. Ponery, “Mechanism of ipamorelin-evoked insulin release from the pancreas of normal and diabetic rats,” Neuro Endocrinol. Lett., vol. 25, no. 6, pp. 403–406, Dec. 2004. [PubMed]",
      "[4] D. E. Beck, W. B. Sweeney, M. D. McCarter, and Ipamorelin 201 Study Group, “Prospective, randomized, controlled, proof-of-concept study of the Ghrelin mimetic ipamorelin for the management of postoperative ileus in bowel resection patients,” Int. J. Colorectal Dis., vol. 29, no. 12, pp. 1527–1534, Dec. 2014. [PubMed]",
      "[5] N. B. Andersen, K. Malmlöf, P. B. Johansen, T. T. Andreassen, G. Ørtoft, and H. Oxlund, “The growth hormone secretagogue ipamorelin counteracts glucocorticoid-induced decrease in bone formation of adult rats,” Growth Horm. IGF Res. Off. J. Growth Horm. Res. Soc. Int. IGF Res. Soc., vol. 11, no. 5, pp. 266–272, Oct. 2001. [PubMed]",
      "[6] J. Svensson et al., “The GH secretagogues ipamorelin and GH-releasing peptide-6 increase bone mineral content in adult female rats,” J. Endocrinol., vol. 165, no. 3, pp. 569–577, Jun. 2000. [PubMed]"
    ],
    "articleAuthor": "",
    "scientificJournalAuthor": "Dr. Jan Izdebski has been listed as a noteworthy Chemist, researcher by Marquis Who's Who. He attained a Master of Science from University Warsaw, Poland, 1959 and is a Doctor of Philosophy, University Warsaw, Poland, 1965, along with a Doctor of Science, University Warsaw, Poland, 1979. He studied how GRF 1-29 is more resistant to enzymatic degradation and how that affects its half-life.\n\nDr. Jan Izdebski is being referenced as one of the leading scientists involved in the research and development of GRF 1-29. In no way is this doctor/scientist endorsing or advocating the purchase, sale, or use of this product for any reason. There is no affiliation or relationship, implied or otherwise, between Peptide Sciences and this doctor. The purpose of citing the doctor is to acknowledge, recognize, and credit the exhaustive research and development efforts conducted by the scientists studying this peptide. Dr. Jan Izdebski is listed in [7] under the",
    "researchSections": [
      {
        "heading": "Research Applications",
        "content": "In laboratory research environments, GHRH analogues and GHSR agonists are used to investigate the regulation of GH secretion patterns in animal models. These peptides support experimental evaluation of pulsatile hormone release, receptor activation timing, and interactions with inhibitory regulators such as somatostatin.\n\nAdditional applications include mechanistic studies examining downstream signaling pathways associated with GH release, including transcriptional regulation and secondary messenger activity in endocrine tissues."
      },
      {
        "heading": "Preclinical Research Summary",
        "content": "Published studies conducted in rodent models and isolated tissue systems have characterized the biochemical and signaling effects of GHRH analogues and GHSR agonists. These investigations report measurable changes in GH secretion profiles, receptor activity, and associated molecular markers under controlled experimental conditions.\n\nObservations reported in the scientific literature are interpreted exclusively within the scope of basic research and endocrine physiology. No clinical, diagnostic, or applied implications are derived from these findings."
      }
    ]
  },
  "sermorelin, ipamorelin": {
    "title": "Sermorelin, Ipamorelin 10mg (Blend)",
    "citations": [
      "L. L. Bagno et al., “Growth Hormone–Releasing Hormone Agonists Reduce Myocardial Infarct Scar in Swine With Subacute Ischemic Cardiomyopathy,” J. Am. Heart Assoc. Cardiovasc. Cerebrovasc. Dis., vol. 4, no. 4, Mar. 2015. [PubMed]",
      "R. M. Kanashiro-Takeuchi et al., “New therapeutic approach to heart failure due to myocardial infarction based on targeting growth hormone-releasing hormone receptor,” Oncotarget, vol. 6, no. 12, pp. 9728–9739, Mar. 2015. [PubMed]",
      "T. Tokudome, K. Otani, M. Miyazato, and K. Kangawa, “Ghrelin and the heart,” Peptides, vol. 111, pp. 42–46, 2019. [PubMed]",
      "S. Tang et al., “Interactions between GHRH and GABAARs in the brains of patients with epilepsy and in animal models of epilepsy,” Sci. Rep., vol. 7, Dec. 2017. [PubMed]",
      "B. S. Shepherd et al., “Endocrine and orexigenic actions of growth hormone secretagogues in rainbow trout (Oncorhynchus mykiss),” Comp. Biochem. Physiol. A. Mol. Integr. Physiol., vol. 146, no. 3, pp. 390–399, Mar. 2007. [PubMed]",
      "N. B. Andersen, K. Malmlöf, P. B. Johansen, T. T. Andreassen, G. Ørtoft, and H. Oxlund, “The growth hormone secretagogue ipamorelin counteracts glucocorticoid-induced decrease in bone formation of adult rats,” Growth Horm. IGF Res. Off. J. Growth Horm. Res. Soc. Int. IGF Res. Soc., vol. 11, no. 5, pp. 266–272, Oct. 2001. [PubMed]",
      "J. Svensson et al., “The GH secretagogues ipamorelin and GH-releasing peptide-6 increase bone mineral content in adult female rats,” J. Endocrinol., vol. 165, no. 3, pp. 569–577, Jun. 2000. [PubMed]",
      "N. K. Aagaard et al., “Growth hormone and growth hormone secretagogue effects on nitrogen balance and urea synthesis in steroid treated rats,” Growth Horm. IGF Res. Off. J. Growth Horm. Res. Soc. Int. IGF Res. Soc., vol. 19, no. 5, pp. 426–431, Oct. 2009. [PubMed]",
      "E. Adeghate and A. S. Ponery, “Mechanism of ipamorelin-evoked insulin release from the pancreas of normal and diabetic rats,” Neuro Endocrinol. Lett., vol. 25, no. 6, pp. 403–406, Dec. 2004. [PubMed]",
      "D. E. Beck, W. B. Sweeney, M. D. McCarter, and Ipamorelin 201 Study Group, “Prospective, randomized, controlled, proof-of-concept study of the Ghrelin mimetic ipamorelin for the management of postoperative ileus in bowel resection patients,” Int. J. Colorectal Dis., vol. 29, no. 12, pp. 1527–1534, Dec. 2014. [PubMed]",
      "R. F. Walker, “Sermorelin: A better approach to management of adult-onset growth hormone insufficiency?,” Clin. Interv. Aging, vol. 1, no. 4, pp. 307–308, Dec. 2006. [PubMed]"
    ],
    "articleAuthor": "",
    "scientificJournalAuthor": "Richard F. Walker, Ph.D, R.Ph, lead author of A better approach to management of adult-onset growth hormone insufficiency?”, received a BS in pharmacy from Rutgers University, a MS in Biochemistry from New Mexico State University and a PhD in a physiology from Rutgers University. He holds postdoctoral fellowships in neuroendocrinology and neuropharmacology at Duke University College of Medicine (Center for the Study of Aging and Human Development) and the University of California, Berkeley, respectively.\n\nRichard F. Walker, Ph.D, R.Ph is being referenced as one of the leading scientists involved in the research and development of Sermorelin. In no way is this doctor/scientist endorsing or advocating the purchase, sale, or use of this product for any reason. There is no affiliation or relationship, implied or otherwise, between Peptide Sciences and this doctor. The purpose of citing the doctor is to acknowledge, recognize, and credit the exhaustive research and development efforts conducted by the scientists studying this peptide. Richard F. Walker, Ph.D, R.Ph is listed in [11] under the",
    "researchSections": [
      {
        "heading": "Research Applications",
        "content": "In preclinical research, sermorelin is utilized to study GHRH-mediated signaling, somatotroph activation, and downstream transcriptional regulation. Ipamorelin is employed to evaluate ghrelin receptor signaling dynamics, calcium mobilization, and secretagogue pathway selectivity. Combined experimental paradigms focus on endocrine pulsatility, receptor cross-talk, and downstream molecular responses."
      },
      {
        "heading": "Preclinical Research Summary",
        "content": "Animal and in-vitro studies have investigated GHRH and ghrelin receptor expression in cardiac, neural, skeletal, and gastrointestinal tissues. Experimental findings include observations related to cellular survival signaling, inflammatory marker modulation, vascular remodeling processes, neural receptor interactions, skeletal metabolism markers, pancreatic signaling pathways, and gastrointestinal motility models. All findings originate from preclinical laboratory research and are used solely to advance mechanistic understanding."
      }
    ]
  },
  "sermorelin, ghrp-6, ghrp-2": {
    "title": "Sermorelin, GHRP-6, GHRP-2 9mg (Blend)",
    "citations": [
      "D. Yamamoto et al., “GHRP-2, a GHS-R agonist, directly acts on myocytes to attenuate the dexamethasone-induced expressions of muscle-specific ubiquitin ligases, Atrogin-1 and MuRF1,” Life Sci., vol. 82, no. 9–10, pp. 460–466, Feb. 2008. [PubMed]",
      "L. T. Phung et al., “The effects of growth hormone-releasing peptide-2 (GHRP-2) on the release of growth hormone and growth performance in swine,” Domest. Anim. Endocrinol., vol. 18, no. 3, pp. 279–291, Apr. 2000.[PubMed]",
      "B. Laferrère, C. Abraham, C. D. Russell, and C. Y. Bowers, “Growth hormone releasing peptide-2 (GHRP-2), like ghrelin, increases food intake in healthy men,” J. Clin. Endocrinol. Metab., vol. 90, no. 2, pp. 611–614, Feb. 2005.[PubMed]",
      "G. Muccioli et al., “Growth hormone-releasing peptides and the cardiovascular system,” Ann. Endocrinol., vol. 61, no. 1, pp. 27–31, Feb. 2000. [PubMed]",
      "V. Bodart et al., “Identification and characterization of a new growth hormone-releasing peptide receptor in the heart,” Circ. Res., vol. 85, no. 9, pp. 796–802, Oct. 1999. [PubMed]",
      "D. D. Taub, W. J. Murphy, and D. L. Longo, “Rejuvenation of the aging thymus: growth hormone-mediated and ghrelin-mediated signaling pathways,” Curr. Opin. Pharmacol., vol. 10, no. 4, pp. 408–424, Aug. 2010. [PubMed]",
      "G. Copinschi et al., “Prolonged oral treatment with MK-677, a novel growth hormone secretagogue, improves sleep quality in man,” Neuroendocrinology, vol. 66, no. 4, pp. 278–286, Oct. 1997. [PubMed]",
      "P. Zeng et al., “Ghrelin receptor agonist, GHRP-2, produces antinociceptive effects at the supraspinal level via the opioid receptor in mice,” Peptides, vol. 55, pp. 103–109, May 2014. [PubMed]",
      "C.-C. Huang, D. Chou, C.-M. Yeh, and K.-S. Hsu, “Acute food deprivation enhances fear extinction but inhibits long-term depression in the lateral amygdala via ghrelin signaling,” Neuropharmacology, vol. 101, pp. 36–45, Feb. 2016. [PubMed]",
      "K. Tóth, K. László, and L. Lénárd, “Role of intraamygdaloid acylated-ghrelin in spatial learning,” Brain Res. Bull., vol. 81, no. 1, pp. 33–37, Jan. 2010. [PubMed]",
      "N. Subirós et al., “Assessment of dose-effect and therapeutic time window in preclinical studies of rhEGF and GHRP-6 coadministration for stroke therapy,” Neurol. Res., vol. 38, no. 3, pp. 187–195, Mar. 2016. [PubMed]",
      "M. Fernández-Mayola et al., “Growth hormone-releasing peptide 6 prevents cutaneous hypertrophic scarring: early mechanistic data from a proteome study,” Int. Wound J., vol. 15, no. 4, pp. 538–546, Aug. 2018. [PubMed]",
      "J. Berlanga et al., “Growth-hormone-releasing peptide 6 (GHRP6) prevents oxidant cytotoxicity and reduces myocardial necrosis in a model of acute myocardial infarction,” Clin. Sci. Lond. Engl. 1979, vol. 112, no. 4, pp. 241–250, Feb. 2007. [PubMed]",
      "H.-J. Huang et al., “The protective effects of Ghrelin/GHSR on hippocampal neurogenesis in CUMS mice,” Neuropharmacology, May 2019. [PubMed]",
      "R. F. Walker, “Sermorelin: A better approach to management of adult-onset growth hormone insufficiency?,” Clin. Interv. Aging, vol. 1, no. 4, pp. 307–308, Dec. 2006. [PubMed]"
    ],
    "articleAuthor": "Article Author\n\nThe above literature was researched, edited and organized by Dr. Logan, M.D. Dr. Logan holds a doctorate degree from Case Western Reserve University School of Medicine and a B.S. in molecular biology.",
    "scientificJournalAuthor": "Richard F. Walker, Ph.D, R.Ph, lead author of A better approach to management of adult-onset growth hormone insufficiency?”, received a BS in pharmacy from Rutgers University, a MS in Biochemistry from New Mexico State University and a PhD in a physiology from Rutgers University. He holds postdoctoral fellowships in neuroendocrinology and neuropharmacology at Duke University College of Medicine (Center for the Study of Aging and Human Development) and the University of California, Berkeley, respectively.\n\nRichard F. Walker, Ph.D, R.Ph is being referenced as one of the leading scientists involved in the research and development of Sermorelin. In no way is this doctor/scientist endorsing or advocating the purchase, sale, or use of this product for any reason. There is no affiliation or relationship, implied or otherwise, between Peptide Sciences and this doctor. The purpose of citing the doctor is to acknowledge, recognize, and credit the exhaustive research and development efforts conducted by the scientists studying this peptide. Richard F. Walker, Ph.D, R.Ph is listed in [22] under the",
    "researchSections": [
      {
        "heading": "Sermorelin, GHRP-6, GHRP-2 Blend: Research Applications",
        "content": "This peptide combination is utilized in laboratory research focused on neuroendocrine signaling, pituitary hormone regulation, and ghrelin-axis biology. Common experimental applications include receptor cross-talk analysis, second-messenger coordination studies, transcriptional profiling, and evaluation of tissue-specific GHS-R1a expression in preclinical systems.\n\nThe formulation supports research into signaling dynamics across central and peripheral tissues, including investigation of receptor-mediated effects on cellular metabolism, protein turnover, and neuroendocrine feedback mechanisms described in animal and cell-based models."
      },
      {
        "heading": "Sermorelin, GHRP-6, GHRP-2 Blend: Preclinical Research Summary",
        "content": "Preclinical in vitro and animal studies have demonstrated that GHRH analogues and ghrelin receptor agonists exert overlapping yet distinct molecular effects on endocrine signaling, receptor distribution, and intracellular pathway activation.\n\nComparative studies of GHRP-2 and GHRP-6 highlight differences in receptor responsiveness, signal duration, and downstream effector engagement, providing valuable tools for mechanistic interrogation of ghrelin-axis regulation without implying clinical relevance."
      }
    ]
  },
  "ghk-cu 1gram": {
    "title": "GHK-Cu 1gram (Copper Peptide) (1000mg) (Topical)",
    "citations": [
      "A. Gruchlik, E. Chodurek, and Z. Dzierzewicz, “Effect of GLY-HIS-LYS and its copper complex on TGF-β secretion in normal human dermal fibroblasts,” Acta Pol. Pharm., vol. 71, no. 6, pp. 954–958, Dec. 2014. [PubMed]",
      "L. Pickart and A. Margolina, “Regenerative and Protective Actions of the GHK-Cu Peptide in the Light of the New Gene Data,” Int. J. Mol. Sci., vol. 19, no. 7, Jul. 2018. [PubMed]",
      "X. Wang et al., “GHK-Cu-liposomes accelerate scald wound healing in mice by promoting cell proliferation and angiogenesis,” Wound Repair Regen. Off. Publ. Wound Heal. Soc. Eur. Tissue Repair Soc., vol. 25, no. 2, pp. 270–278, 2017. [PubMed]",
      "G. D. Mulder et al., “Enhanced healing of ulcers in patients with diabetes by topical treatment with glycyl-l-histidyl-l-lysine copper,” Wound Repair Regen. Off. Publ. Wound Heal. Soc. Eur. Tissue Repair Soc., vol. 2, no. 4, pp. 259–269, Oct. 1994. [PubMed]",
      "S. O. Canapp et al., “The effect of topical tripeptide-copper complex on healing of ischemic open wounds,” Vet. Surg. VS, vol. 32, no. 6, pp. 515–523, Dec. 2003. [PubMed]",
      "L. Pickart, J. M. Vasquez-Soltero, and A. Margolina, “The Effect of the Human Peptide GHK on Gene Expression Relevant to Nervous System Function and Cognitive Decline,” Brain Sci., vol. 7, no. 2, Feb. 2017. [PubMed]",
      "H. Zhang, Y. Wang, and Z. He, “Glycine-Histidine-Lysine (GHK) Alleviates Neuronal Apoptosis Due to Intracerebral Hemorrhage via the miR-339-5p/VEGFA Pathway,” Front. Neurosci., vol. 12, p. 644, 2018. [PubMed]",
      "X.-M. Zhou et al., “GHK Peptide Inhibits Bleomycin-Induced Pulmonary Fibrosis in Mice by Suppressing TGFβ1/Smad-Mediated Epithelial-to-Mesenchymal Transition,” Front. Pharmacol., vol. 8, p. 904, 2017. [PubMed]",
      "J.-R. Park, H. Lee, S.-I. Kim, and S.-R. Yang, “The tri-peptide GHK-Cu complex ameliorates lipopolysaccharide-induced acute lung injury in mice,” Oncotarget, vol. 7, no. 36, pp. 58405–58417, Sep. 2016. [PubMed]",
      "L. А. Sever’yanova and D. V. Plotnikov, “Binding of Glyprolines to L-Arginine Inverts Its Analgesic and Antiagressogenic Effects,” Bull. Exp. Biol. Med., vol. 165, no. 5, pp. 621–624, Sep. 2018. [PubMed]"
    ],
    "articleAuthor": "Article Author\n\nThe above literature was researched, edited and organized by Dr. Logan, M.D. Dr. Logan holds a doctorate degree from Case Western Reserve University School of Medicine and a B.S. in molecular biology.",
    "scientificJournalAuthor": "Loren Pickart, Ph.D. has released 109 publications and is developing patents and analyzing GHK's effects on human gene expression of 4,192 genes. In addition to GHK's published potential uses on skin inflammation, metastatic cancer and COPD, it appears to have beneficial effects on other tissue systems such as the nervous system, gastrointestinal system, and mitochondrial system. His brief but detailed autobiography dives into the motivations and background behind his dedicating to skin, anti-aging, and life-long training.\n\nLoren Pickart, Ph.D is being referenced as one of the leading scientists involved in the research and development of GHK-Cu. In no way is this doctor/scientist endorsing or advocating the purchase, sale, or use of this product for any reason. There is no affiliation or relationship, implied or otherwise, between Peptide Sciences and this doctor. The purpose of citing the doctor is to acknowledge, recognize, and credit the exhaustive research and development efforts conducted by the scientists studying this peptide. Loren Pickart, Ph.D is listed in [1] [3] and [8] under the",
    "researchSections": [
      {
        "heading": "GHK-Cu 1gram (Copper Peptide): Research Applications",
        "content": "GHK-Cu is supplied exclusively as a research reagent for laboratory-based investigation. Common experimental applications include studies of copper-peptide coordination chemistry, modulation of transcriptional networks, extracellular matrix turnover, angiogenic signaling pathways, antimicrobial peptide interactions, and cellular stress-response mechanisms. The peptide is frequently employed in cell culture systems, biochemical assays, and controlled animal models to explore pathway-level responses to copper-bound peptide signaling."
      },
      {
        "heading": "GHK-Cu 1gram (Copper Peptide): Preclinical Research Summary",
        "content": "The referenced literature comprises exclusively preclinical investigations conducted in cell-based systems and animal models. These studies examine GHK-Cu–associated modulation of extracellular matrix synthesis, antimicrobial activity in vitro, neurovascular signaling pathways, inflammatory mediator regulation, and apoptosis-related molecular mechanisms. Observations reported in the cited publications are limited to defined experimental contexts and do not extend beyond laboratory research models."
      }
    ]
  }
}